{"jobs":[{"company":"OmniPay","company_logo":"https://media.licdn.com/dms/image/v2/C4D0BAQHWXyj6Bm73cQ/company-logo_100_100/company-logo_100_100/0/1676988481266?e=2147483647&v=beta&t=HXP5iEumjrvupfbflJ6An-4qOdN1r0AL_3NXG8VEnlQ","company_url":"https://omniretail.africa/products/omnipay/","description":"About Omniretail&nbsp;Omniretail is Africa’s fastest-growing startup focused on digitizing trade to provide manufacturers with unparalleled visibility into their supply chain. Leveraging technology, logistics, and financing solutions, we empower small and medium-sized enterprises (SMEs) to thrive in emerging markets.&nbsp;We operate a robust Platform as a Service (PaaS) and a Fintech solution offering working capital access, rewards programs, and sustainable business practices. At Omniretail, we believe in fostering strong partnerships and driving measurable impact across the trade ecosystem.&nbsp;About the Role:We are looking for a skilled Golang Engineer with experience in FinTech, Payments, Banking, or Financial systems to join our team. You will design, build, and optimize high-performance, secure, and scalable backend systems that power our financial products.Key Responsibilities:Design, develop, and maintain high-performance, low-latency backend services in Golang.Work on payment processing, transaction systems, risk management, or fraud detection.Optimize distributed systems for scalability, reliability, and security.Integrate with third-party banking APIs, payment gateways, and financial data providers.Ensure compliance with financial regulations (PCI-DSS, PSD2, AML, etc.).Implement real-time transaction processing, reconciliation, and reporting.Collaborate with cross-functional teams (product, security, compliance) to deliver FinTech solutions.Write clean, maintainable, and well-tested code with a focus on performance and security.Required Skills &amp; Experience:Strong expertise in Golang (concurrency, performance tuning, microservices).FinTech domain experience (payments, banking, trading, lending, etc.).Experience with distributed systems, event-driven architectures (Kafka, RabbitMQ).Knowledge of SQL/NoSQL databases (PostgreSQL, MongoDB, Cassandra).Familiarity with cloud platforms (AWS/GCP/Azure) and containerization (Docker, Kubernetes).Understanding of security best practices in FinTech (encryption, authentication, OAuth2).Experience with REST/gRPC APIs and API gateways.Knowledge of regulatory requirements (PCI-DSS, GDPR, PSD2) is a plus.Nice to Have:Knowledge of real-time data processing (Apache Flink, Spark).Contributions to open-source projects or Golang libraries.Why Join Us?Work on cutting-edge FinTech products with global impact.Competitive salary, equity, and benefits.Flexible work environment (remote/hybrid options).Opportunity to grow in a fast-paced FinTech startup/scaleup.","id":"7bfb0bc6-3167-4ee1-afe0-d026b8aaacad","is_remote":true,"job_id":"4208657782","job_type":"Contract","location":"Lagos State, Nigeria","posted_at":"2025-04-17T00:00:00Z","salary":"","source":"apify linkedin","title":"Golang Engineer (Fintech experience)","url":"https://ng.linkedin.com/jobs/view/golang-engineer-fintech-experience-at-omnipay-4208657782?refId=3pTZj%2F9ibnBgsvl8GpMcSg%3D%3D&trackingId=Cmz8XY5FZTSBpe9XY%2Bt1Dw%3D%3D&position=2&pageNum=0"},{"company":"Trilogy","company_logo":"https://media.licdn.com/dms/image/v2/D4D0BAQHo46awkKVsFg/company-logo_100_100/B4DZY4U_eJHAAQ-/0/1744701749693/trilogy_logo?e=2147483647&v=beta&t=W4tooyMlcMPn_j2D6bmsg-3JPrlXD7qIAJEcsoP05Is","company_url":"http://www.trilogy.com","description":"Are you an engineer who cringes at the thought of subpar code, sluggish deployments, and antiquated development practices? If you're not just about writing software but about crafting AI-powered systems that redefine efficiency, then this is your calling.While many teams are stuck in the past with manual debugging and rudimentary AI applications, Trilogy stands out. Our development process is seamlessly integrated with AI from ideation to optimization, ensuring speed, precision, and zero waste. This isn't about dabbling in AI—it's about embedding it into every facet of software development.As a Software Engineer with us, you'll transform existing B2B products into cloud-native marvels, enhancing them with AI at every turn. You'll lead in developing AI-driven features, utilize cutting-edge retrieval-augmented generation for automated defect detection, and guarantee seamless releases with zero interruptions. If endless debates over architecture are your thing, this role isn't. But if you're eager to advance in AI-driven, high-scale cloud-native development, apply now. If you're content with the status quo, this isn't your fit.What You Will Be DoingEmploy advanced analysis tools and RAG vector stores to spot, diagnose, and rectify product defects and bugs.Utilize AI development agents to architect, craft, and deploy groundbreaking features for cloud-native applications.Work collaboratively with a global team to deliver top-tier, enterprise-level solutions.What You Won’t Be DoingRoutine Monotony: Say goodbye to tedious infrastructure tasks and hello to innovative solution creation.Endless Meetings: Your development skills are valued over meeting attendance. Expect more coding, less talking.Software Engineer Key ResponsibilitiesDevelop AI-driven features to enhance workflows and equip service providers with groundbreaking tools.Basic RequirementsA mindset that prioritizes AI-first approaches (if you prefer writing code before leveraging AI tools, this isn't for you).Over 4 years of experience in software development, with a focus on production code for server-side web applications.Professional experience in creating highly reliable B2B software applications.Hands-on expertise in cloud-native development or serverless architectures, particularly with AWS.Professional experience with GenAI code assistants (e.g., Github Copilot, Cursor.sh, v0.dev).Proven track record in implementing Generative AI solutions with significant quantitative impact.About TrilogyHundreds of software businesses run on the Trilogy Business Platform. For three decades, Trilogy has been known for 3 things: Relentlessly seeking top talent, Innovating new technology, and incubating new businesses. Our technological innovation is spearheaded by a passion for simple customer-facing designs. Our incubation of new businesses ranges from entirely new moon-shot ideas to rearchitecting existing projects for today's modern cloud-based stack. Trilogy is a place where you can be surrounded with great people, be proud of doing great work, and grow your career by leaps and bounds.There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you!Working with usThis is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover as a Contractor of Record. The compensation level for this role is $30 USD/hour, which equates to $60,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic.Crossover Job Code: LJ-3889-NG-Osun-SoftwareEngine.009","id":"7b76edb5-f44d-4727-9590-3e4593a51df0","is_remote":false,"job_id":"4208997865","job_type":"Full-time","location":"Nigeria","posted_at":"2025-04-15T00:00:00Z","salary":"$30.00","source":"apify linkedin","title":"Software Engineer, Trilogy (Remote) - $60,000/year USD","url":"https://ng.linkedin.com/jobs/view/software-engineer-trilogy-remote-%2460-000-year-usd-at-trilogy-4208997865?refId=3pTZj%2F9ibnBgsvl8GpMcSg%3D%3D&trackingId=Yzxw010CbXvub7lrLBnGHw%3D%3D&position=24&pageNum=0"},{"company":"Traction Apps","company_logo":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR0a2XvcFgUuYEZ8u743_d36kbKH_HIbvAhWU-j&s=0","company_url":"https://tractionapps.co","description":"Company Description\n\nTraction Apps is a one-stop platform for small businesses to accept payments, manage operations, and access capital for growth. We are dedicated to building the operating system for SMEs in Africa, empowering small businesses to thrive in the digital economy.\n\nRole Description\n\nThis is a remote contract role for a Golang Software Engineer. The role involves developing and maintaining back-end applications, writing clean and efficient code using Golang, and collaborating with cross-functional teams to deliver high-quality software solutions. Daily tasks include analyzing user requirements, designing software architecture, debugging and testing applications, and ensuring performance optimization.\n\nQualifications\n• Strong skills in Back-End Web Development and Software Development\n• Proficient in Programming with expertise in GoLang\n• Experience with Object-Oriented Programming (OOP) principles\n• Solid understanding of Computer Science fundamentals\n• Excellent problem-solving and analytical skills\n• Effective communication and teamwork abilities\n• Should be able to work with little or no supervision\n• Experience working with Agile methodology\n• Experience with cloud technologies and services is a plus\n• Bachelor's degree in Computer Science or related field\n• Experience with payment systems or have worked with a fintech company.\n• Solid experience on API integration ( REST, SOAP etc)\n• Experience with Cloud is optional but good to have.","id":"a0feac3b-16fe-4853-92c9-5ed6f8105757","is_remote":false,"job_id":"91ea8a7b-efae-4d3d-9743-7dce76023166","job_type":"Contractor","location":"Lagos","posted_at":"2025-04-14T22:00:00Z","salary":"","source":"jsearch","title":"Golang Software Engineer","url":"https://ng.linkedin.com/jobs/view/golang-software-engineer-at-traction-apps-4208479116?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"company":"We are META","company_logo":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSGq3vgV-LdHkk1cSFDvfWV7poZkESrVTy__IeK&s=0","company_url":"https://wearemeta.io","description":"At We are META (Permanent), in Portugal\nExpires at: 2025-07-09\nRemote policy: Full remote\n\nSeeking a Golang Developer: Rhino, are you there?\n\nAt WE ARE META, we focus on finding the perfect match between our Rhinos and our clients.\n\nWhy join us?\n• Expand your network: As a consultant at We Are META, you’ll have access to a network of national and international partners across diverse sectors of the tech industry.\n• Enjoy our perks: When you join the crash you’ll have an array of benefits , to help you achieve the best work-life balance.\n• Get your perfect match: Our recruiters do their best to get the best position for you, whether in terms of working policy (remote, hybrid, on-site) or the company’s culture .\n• Personalized support: With our career coach , we assure that all your needs are being met and you’re being provided everything you need to excel in your professional life because the well-being of our Rhinos is our number one priority.\nMain requirements\n\nFor this position, the perfect Rhino should have the following skills:\n• +5 years of professional experience as a Golang Developer;\n• Experience with distributed systems, microservices architecture, and cloud environments;\n• Familiarity with database technologies (SQL and NoSQL);\n• Proficiency in version control tools such as Git;\n• Solid understanding of containerization tools (e.g., Docker, Kubernetes);\n• Fluency in English (B2) and Portuguese (B1)\n• Availability for full remote work model, with periodic travels to France.\nBenefits & Perks\n\nPerks of becoming a Rhino:\n• You’ll get a welcome kit\n• Opportunities for career progression\n• Live on the edge with our health insurance\n• Watch your favorite shows and music with HBO and Spotify accounts\n• Coverflex meal card\n• Other protocols and special discounts ✨\n\nOriginal job Golang Developer posted on GrabJobs ©. To flag any issues with this job please use the Report Job button on GrabJobs.","id":"a4c16bc0-e1a1-475e-a816-9997afdc45e8","is_remote":false,"job_id":"04563f0a-2a84-4718-a678-a379147d88a6","job_type":"Full-time","location":"Nigeria","posted_at":"2025-04-12T12:00:00Z","salary":"","source":"jsearch","title":"Golang Developer","url":"https://grabjobs.co/nigeria/job/full-time/others/golang-developer-1744460140997280?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"company":"Precise Financial Systems Ltd","company_logo":"","company_url":"","description":"*OUR ORGANIZATION:*\n\nWe are a world-class software consultancy and development company with decades of experience in delivering innovative technology solutions. Since our establishment, we have built a reputation for excellence, adaptability, and resilience, consistently identifying opportunities for growth in diverse economic conditions.\n\n*WHAT YOU'LL DO:*\n\n*As a Full Stack Software Developer, you will be responsible for designing, developing, and maintaining high-quality software solutions using majorly C#, React and MSSQL to develop financial soltuions. You will collaborate with cross-functional teams to deliver innovative and scalable software products.*\n\n*SUMMARY OF RESPONSIBILITIES:*\n\nHe/she must be able to handle all tasks to satisfy all of the core responsibilities in the areas of software development.\n\n*DUTIES:*\n\nThis contract role shall see to the development of financial software solutions in alignment with PFS’ policies and procedures (as set out in the process flow):\n* Write clean, efficient, and well-documented code that meets industry standards.\n* Conduct thorough testing and debugging of applications to ensure software quality and performance.\n* Participate in code reviews to provide constructive feedback and ensure adherence to coding best practices.\n* Collaborate with several teams (e.g. Project Managers, Product Management, QA, BDG) to achieve a common goal of solving customer problems and enhancing the company’s products.\n* Troubleshoot and resolve software defects and issues reported by users or discovered during testing.\n* Coordinate with co-developers, keep the project manager well informed of the status of the development effort, and serve as a liaison between development staff and the project manager.\n* Contribute to the continuous improvement of development processes and workflows.\n\n*ESSENTIAL SKILLS*\n\n1. Ability to work as a member of a multi-disciplinary professional team working in a multi-cultural environment.\n\n2. Ability to multi-task and to work under pressure.\n\n3. Ability to convey findings, ideas and opinions in a convincing manner in all written material (spoken and written).\n\n4. Ability to apply relationship skills including tact and discretion.\n\n5. Ability to make effective presentations.\n\n6. Excellent organizational, analytical, and problem-solving skills.\n\n7. Must possess strong cross team collaboration skills.\n\n\n\n*QUALIFICATIONS & KNOWLEDGE REQUIREMENTS:*\n* A bachelor's degree in computer science, software engineering, or a related field (or equivalent practical experience).\n* Proven experience as a Full Stack Engineer with proficiency in C#.\n* Strong experience with React frameworks.\n* Experience developing SaaS-style applications and/or public APIs.\n* Hands-on experience with SQL schema design, SOLID principles, and REST API design\n* Proficiency in using version control systems (e.g., Git) and collaboration tools.\n* Strong problem-solving and analytical skills with a keen attention to detail.\n* Ability to work effectively both independently and collaboratively within a team.\n* Excellent verbal and written communication skills.\n* Strong organisational and time management skills, with the ability to prioritise tasks effectively.\n* Database management experience (e.g., MSSQL, MySQL, PostgreSQL) and proficiency with caching systems like Redis or Memcached.\n* Proficiency with version control systems, preferably Git.\n* Strong problem-solving abilities and attention to detail.\n* Software testing (PHP Unit, PHP Spec, Behat). MySQL profiling and query optimisation\n* Experience in Financial Services is an added advantage.\n* Experience with other programming languages and technologies, such as Java, Golang, or containerisation (e.g., Docker, Kubernetes), is a plus.\n\n*WORK MODE: *Remote\n\nJob Types: Temporary, Contract\nContract length: 6 months\n\n\n\nAbility to commute/relocate:\n* Lagos: Reliably commute or planning to relocate before starting work (Required)\n\nApplication Question(s):\n* Are you able to resume on or before May 2, 2025?\n\n\nApplication Deadline: 18/04/2025\nExpected Start Date: 02/05/2025","id":"958efb0c-618d-4b25-8db5-669d7d99f5da","is_remote":true,"job_id":"e73cbd7debf621fd","job_type":"Temporary","location":"Lagos","posted_at":"2025-04-11T14:00:32Z","salary":"","source":"apify indeed","title":"Senior Full Stack Developer (C#, React & MSSQL)","url":"https://ng.indeed.com/viewjob?jk=e73cbd7debf621fd"},{"company":"Hanbiro Inc","company_logo":"https://cdn.brandfetch.io/idnAZfpzrZ/w/820/h/260/theme/dark/logo.png?c=1bxidIPTRtzv36oeM-tGb","company_url":"https://en.hanbiro.com","description":"5 days ago\n\nBackend Golang Developer\n\nHanbiro Inc\n\nSoftware & Data\n\nRemote (Work From Home) Contract\n\nIT & Telecoms NGN 250,000 - 400,000 Negotiable\n\nEasy Apply\n\nSkills Required\nRESTful APIs\n\nJob Summary\n\nWe are looking for a skilled Backend Golang Developer to develop, test, and optimize the Hanbiro Backend Development Platform (BDP) using Golang. In this role, you will also create clear and concise user guides to help customers understand and utilize our solutions effectively. You will collaborate with a team to build scalable, high-performance APIs and backend solutions for cloud-based services.\n• Minimum Qualification : Degree\n• Experience Level : Entry level\n• Experience Length : 2 years\n• Working Hours : Full Time\n\nJob Description/Requirements\n\nResponsibilities:\n• Develop, test, and maintain backend solutions using Golang.\n• Design, build, and optimize APIs and system integrations for cloud-based services (e.g., Identity Access Management, Webhooks, Email, and Team Channel solutions).\n• Conduct unit testing to ensure software correctness, robustness, and scalability.\n• Optimize mobile and web applications to enhance user experience and business performance.\n• Collaborate with cross-functional teams to design and develop backend solutions.Write technical documentation, system guidelines, and user manuals.\n\nRequirements:\n• Bachelor’s degree in Computer Science, Software Engineering, Information Technology, or a related field (equivalent work experience may be considered)\n• 2+ years of experience in backend development, IT infrastructure, or a related field\n• Strong understanding of RESTful APIs, microservices architecture, and database management (SQL/NoSQL).\n• Experience with authentication flows (OAuth, JWT, Firebase Auth).\n• Ability to debug and troubleshoot issues for improved application stability.\n• Experience in designing and implementing scalable, high-performance APIs and microservices.\n• Knowledge of system reliability, security, and performance optimization.\n• Comfortable working in an Agile/Scrum development environment.\n• Ability to work independently in a remote setting.\n• Strong technical documentation skillsAbility to write clear, efficient, and well-structured documentation.\n\nAdditional skills:\n• English proficiency is required; Korean/Vietnamese language skills are a plus.","id":"f4d573ce-82b1-4077-924b-e8adedde76dc","is_remote":false,"job_id":"6110962d-2b66-4ad6-8f24-0d0850aa836e","job_type":"Contractor","location":"Nigeria","posted_at":"2025-04-02T00:00:00Z","salary":"","source":"jsearch","title":"Backend Golang Developer","url":"https://ng.indeed.com/viewjob?jk=1955c805f2737674&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"company":"Kredete","company_logo":"https://media.licdn.com/dms/image/v2/D4E0BAQE0R_91oObIeA/company-logo_100_100/company-logo_100_100/0/1728019309458/kredete_logo?e=2147483647&v=beta&t=cR-eLw5R2KwXg5gJKJfeYDHAN5wApUi6vwpc0825skk","company_url":"https://www.kredete.io","description":"About KredeteKredete is a financial technology platform designed to help African immigrants build credit and send money instantly to over 22 African countries. Using Stablecoins and modern payment systems, we make it easy and affordable for businesses to move money across borders. Our mission is to provide accessible, secure, and low-cost financial solutions that improve cash flow and support financial growth for individuals and businesses.About the role:We are seeking a highly skilled DevOps/Site Reliability Engineer (SRE) to work with our engineering team. The ideal candidate will have a passion for designing, implementing, and managing scalable, reliable, and secure systems. You will be instrumental in ensuring system reliability, automation, and the smooth operation of our infrastructure.Key Responsibilities:Ensure the reliability, availability, and performance of infrastructure and applications.Implement monitoring and alerting solutions to identify and resolve issues proactively.Automation &amp; Scalability:Develop automation frameworks for infrastructure provisioning, configuration management, and deployment processes.Create and maintain CI/CD pipelines to streamline software delivery.Incident Management:Troubleshoot production incidents, conduct post-incident reviews, and implement preventive measures.Develop and maintain runbooks for handling recurring issues.Infrastructure as Code (IaC):Design, build, and maintain cloud infrastructure using IaC tools (an excellent knowledge of CloudFormation is required and other popular IaC tools like Terraform and Ansible).Optimize resource utilization and reduce operational costs.Collaboration &amp; Communication:Work closely with development teams to integrate reliability into the software lifecycle.Provide technical guidance and promote best practices in DevOps and SRE methodologies.Security &amp; Compliance:Ensure infrastructure complies with security best practices and relevant regulations.Monitor and address vulnerabilities in collaboration with the security team.Required Qualifications:Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience).3+ years of experience in DevOps and SRE.Strong experience with AWS cloud infrastructure (knowing Azure, or GCP will add more credit).Proficiency in containerization and orchestration tools (Docker, Kubernetes, ECS). A good experience with the three mentioned here is necessary.Hands-on experience with CI/CD tools, primarily Github Action (Jenkins, GitLab CI, CircleCI will add more credit).Solid understanding of Linux/Unix systems and networking concepts.Proficient in scripting/programming languages (e.g., Python, Bash, Go).Experience with monitoring tools like Prometheus, Grafana, or Datadog.Preferred Qualifications:Certifications in cloud platforms, primarily AWS Certified DevOps Engineer (Google Cloud Professional DevOps Engineer will be a plus too).Familiarity with chaos engineering principles.Experience with database management and performance tuning (SQL and NoSQL).Knowledge of compliance standards (e.g., SOC 2, ISO 27001).Compensation:From N700,000 monthlyComprehensive Health insurance packageTeam &amp; task-based bonuses and perksWhy work with Kredete?Meaningful Impact: Work with a company focused on financial empowerment for African communities.Innovative Projects: Be part of exciting work that combines payments, fintech, blockchain, and AI.Growth Opportunities: Join a fast-growing company with lots of room for career growth.","id":"abdb0915-487c-4373-a7bc-cdec5f6677c0","is_remote":false,"job_id":"4196423169","job_type":"Full-time","location":"Lekki, Lagos State, Nigeria","posted_at":"2025-04-02T00:00:00Z","salary":"","source":"apify linkedin","title":"Site Reliability Engineer","url":"https://ng.linkedin.com/jobs/view/site-reliability-engineer-at-kredete-4196423169?refId=FAWR6XwIamzs%2FhEWG5d7Ig%3D%3D&trackingId=C9yATw2gdVSBZA3D493AoA%3D%3D&position=22&pageNum=1"},{"company":"SavyOps","company_logo":"https://media.licdn.com/dms/image/v2/D560BAQHWyFXsDxiLSQ/company-logo_200_200/B56ZUn.nAtHEAI-/0/1740132482780?e=2147483647&v=beta&t=aZwWxkxi8msiyjPe3u84abaTlvwaPF8PX6JflTYLJQA","company_url":"https://www.linkedin.com/company/savyops","description":"","id":"c2a5b414-b4db-4ec6-ad3b-a81405c5f1e9","is_remote":false,"job_id":"1517210247","job_type":"","location":"Lagos, Lagos, Nigeria","posted_at":"2025-03-30T08:30:37Z","salary":"","source":"linkedin","title":"Software Engineer - Python & Golang (2 Months Contract)","url":"https://ng.linkedin.com/jobs/view/software-engineer-python-golang-2-months-contract-at-savyops-4195866751"},{"company":"Ubiti Technologies","company_logo":"","company_url":"","description":"Job Summary\n\n\n\nWe are seeking an experienced Full Stack Developer to lead the development of a secure, scalable, and high-performance crypto-to-naira exchange platform. The ideal candidate must have expertise in blockchain integration, payment gateways, and real-time transaction processing for both web and mobile applications.\n\n\n\n⸻\n\n\n\nKey Responsibilities\n\n\n\n1. Backend Development:\n\n\t•\tDesign and implement a secure and scalable backend architecture.\n\n\t•\tDevelop real-time trading, wallet, and transaction processing features.\n\n\t•\tIntegrate blockchain APIs (Binance, Ethereum, Bitcoin, etc.) to enable deposits, withdrawals, and trading.\n\n\t•\tBuild automated KYC verification (ID verification, selfie verification).\n\n\t•\tImplement anti-fraud security features like 2FA, IP tracking, and AML compliance.\n\n\t•\tDevelop a robust admin dashboard for monitoring transactions and user activities.\n\n\n\n2. Frontend Development:\n\n\t•\tBuild a responsive web platform (React, Next.js, or Vue.js preferred).\n\n\t•\tDevelop a mobile-friendly interface (React Native, Flutter, or Swift/Kotlin).\n\n\t•\tOptimize UI/UX for fast transactions and seamless user experience.\n\n\t•\tImplement real-time price updates using WebSockets.\n\n\n\n3. Database & Security:\n\n\t•\tDesign and manage scalable databases (PostgreSQL, MongoDB, or MySQL).\n\n\t•\tImplement data encryption & secure authentication (OAuth, JWT, 2FA, Google Authenticator).\n\n\t•\tEnsure compliance with GDPR, AML, and PCI-DSS security standards.\n\n\n\n4. API & Third-Party Integrations:\n\n\t•\tIntegrate crypto payment gateways (CoinPayments, NowPayments, etc.).\n\n\t•\tConnect with local Naira payment processors (Paystack, Flutterwave, Monnify).\n\n\t•\tImplement automated exchange rate updates via third-party APIs.\n\n\n\n⸻\n\n\n\nRequirements & Qualifications\n\n\t•\t3+ years of experience as a Full Stack Developer in crypto, fintech, or payments.\n\n\t•\tProficiency in backend technologies (Node.js, Python, Golang, or PHP Laravel).\n\n\t•\tStrong experience in frontend frameworks (React, Next.js, Vue.js).\n\n\t•\tDatabase management skills (MongoDB, PostgreSQL, Firebase, MySQL).\n\n\t•\tExperience with blockchain APIs & Web3.js (Solidity knowledge is a plus).\n\n\t•\tFamiliarity with payment gateway integrations (Paystack, Flutterwave, Binance Pay, etc.).\n\n\t•\tStrong knowledge of RESTful & GraphQL APIs, WebSockets.\n\n\t•\tExperience with cloud platforms (AWS, Google Cloud, or DigitalOcean).\n\n\t•\tFamiliarity with DevOps tools (Docker, Kubernetes, CI/CD pipelines).\n\n\t•\tSolid understanding of cryptography & security best practices.\n\n\t•\tAbility to write clean, scalable, and maintainable code.\n\n\n\n⸻\n\n\n\nNice to Have (Bonus Skills)\n\n\t•\tKnowledge of Solidity & Smart Contracts.\n\n\t•\tExperience with AI/ML for fraud detection.\n\n\t•\tPrior work in a crypto exchange, P2P trading platform, or fintech startup.\n\nJob Type: Full-time\n\nPay: ₦400,000.00 per month\n\n\nExpected Start Date: 02/04/2025","id":"d4f8afd1-1c41-4fe7-9594-89c72819f7d8","is_remote":false,"job_id":"67ba8158997d94f8","job_type":"Full-time","location":"Lagos","posted_at":"2025-03-28T12:47:54Z","salary":"₦400,000 a month","source":"apify indeed","title":"Full Stack Developer (Crypto/Pre Senior Level)","url":"https://ng.indeed.com/viewjob?jk=67ba8158997d94f8"},{"company":"Haus","company_logo":"https://media.licdn.com/dms/image/v2/D4D0BAQG9HWVkvAfXRw/company-logo_100_100/B4DZV2iy9lHIAQ-/0/1741450589226?e=2147483647&v=beta&t=nbvgsa1TxXwgBnbjgQEOhtNRNZwrR2VlpkmOZNVqJfY","company_url":"https://www.linkedin.com/company/hauslaunch?trk=public_jobs_jserp-result_job-search-card-subtitle","description":"HAUS is building the future of real estate investment through blockchain technology. Our platform enables fractional ownership of real estate via tokenization, making property investment accessible, liquid, and globally scalable. We are at the cutting edge of real estate and Web3, and we’re looking for a Lead Blockchain Developer to drive the development of our platform.⸻The RoleWe’re seeking a Lead Blockchain Developer (potentially cofounder) to design, develop, and deploy the smart contract infrastructure that powers HAUS. You’ll play a key role in building the platform on an existing blockchain (e.g., Ethereum, Polygon) and ensuring secure, efficient, and seamless real estate tokenization. ⸻What You’ll Do:Develop and deploy smart contracts for real estate tokenization, rental income distribution, and governance mechanisms.Integrate blockchain functionalities with our web and mobile applications via Web3 APIs.Optimize smart contracts to ensure efficiency, security, and cost-effectiveness (gas fees).Collaborate with frontend/backend engineers to create a seamless user experience.Ensure compliance with relevant blockchain and financial regulations.Lead technical decisions related to the blockchain architecture and scaling of the platform.Contribute to product strategy, ensuring HAUS is built for long-term success.⸻What We’re Looking For:3+ years of experience in blockchain development (Ethereum, Polygon, or similar).Strong proficiency in Solidity and smart contract development.Experience with Web3.js, ethers.js, or similar frameworks for blockchain interactions.Familiarity with DeFi concepts, token standards (ERC-20, ERC-721, ERC-1155), and governance mechanisms.Security-first mindset with knowledge of smart contract vulnerabilities and best practices.Strong problem-solving skills and the ability to work independently in a startup environment.Bonus: Experience with real estate, fintech, or tokenization projects.⸻Why Join HAUS?Be a Pioneer: Join a pioneering real estate tokenization project that opens local markets to global investors.Significant Impact: Play a crucial role in building and shaping a game-changing platform from the ground up.Equity &amp; Growth: Sizable equity stake on the table. If you have an entrepreneurial spirit and share our long-term vision, there’s a potential pathway to becoming our Chief Product &amp; Technology Officer (CPTO) as we grow.Innovative Environment: Collaborate with a passionate, driven team committed to reshaping real estate investment through Web3 technology.⸻","id":"377366bd-5c60-4b94-99ea-c1f70f2aea2d","is_remote":false,"job_id":"4192303578","job_type":"Full-time","location":"Abuja, Federal Capital Territory, Nigeria","posted_at":"2025-03-27T00:00:00Z","salary":"","source":"apify linkedin","title":"Blockchain Developer","url":"https://ng.linkedin.com/jobs/view/blockchain-developer-at-haus-4192303578?refId=DGw%2BPjVng50e%2BGevhbuZOA%3D%3D&trackingId=pFgQYte%2F8mxmSlgMZ3nO1w%3D%3D&position=25&pageNum=0"},{"company":"Haus","company_logo":"https://media.licdn.com/dms/image/v2/D4D0BAQG9HWVkvAfXRw/company-logo_100_100/B4DZV2iy9lHIAQ-/0/1741450589226?e=2147483647&v=beta&t=nbvgsa1TxXwgBnbjgQEOhtNRNZwrR2VlpkmOZNVqJfY","company_url":"https://www.linkedin.com/company/hauslaunch?trk=public_jobs_jserp-result_job-search-card-subtitle","description":"HAUS is building the future of real estate investment through blockchain technology. Our platform enables fractional ownership of real estate via tokenization, making property investment accessible, liquid, and globally scalable. We are at the cutting edge of real estate and Web3, and we’re looking for a Lead Blockchain Developer to drive the development of our platform.⸻The RoleWe’re seeking a Lead Blockchain Developer (potentially cofounder) to design, develop, and deploy the smart contract infrastructure that powers HAUS. You’ll play a key role in building the platform on an existing blockchain (e.g., Ethereum, Polygon) and ensuring secure, efficient, and seamless real estate tokenization. ⸻What You’ll Do:Develop and deploy smart contracts for real estate tokenization, rental income distribution, and governance mechanisms.Integrate blockchain functionalities with our web and mobile applications via Web3 APIs.Optimize smart contracts to ensure efficiency, security, and cost-effectiveness (gas fees).Collaborate with frontend/backend engineers to create a seamless user experience.Ensure compliance with relevant blockchain and financial regulations.Lead technical decisions related to the blockchain architecture and scaling of the platform.Contribute to product strategy, ensuring HAUS is built for long-term success.⸻What We’re Looking For:3+ years of experience in blockchain development (Ethereum, Polygon, or similar).Strong proficiency in Solidity and smart contract development.Experience with Web3.js, ethers.js, or similar frameworks for blockchain interactions.Familiarity with DeFi concepts, token standards (ERC-20, ERC-721, ERC-1155), and governance mechanisms.Security-first mindset with knowledge of smart contract vulnerabilities and best practices.Strong problem-solving skills and the ability to work independently in a startup environment.Bonus: Experience with real estate, fintech, or tokenization projects.⸻Why Join HAUS?Be a Pioneer: Join a pioneering real estate tokenization project that opens local markets to global investors.Significant Impact: Play a crucial role in building and shaping a game-changing platform from the ground up.Equity &amp; Growth: Sizable equity stake on the table. If you have an entrepreneurial spirit and share our long-term vision, there’s a potential pathway to becoming our Chief Product &amp; Technology Officer (CPTO) as we grow.Innovative Environment: Collaborate with a passionate, driven team committed to reshaping real estate investment through Web3 technology.⸻","id":"ff855efa-492b-472a-8f29-0b1a2ead690b","is_remote":false,"job_id":"4192303578","job_type":"Full-time","location":"Abuja, Federal Capital Territory, Nigeria","posted_at":"2025-03-27T00:00:00Z","salary":"","source":"apify linkedin","title":"Blockchain Developer","url":"https://ng.linkedin.com/jobs/view/blockchain-developer-at-haus-4192303578?refId=CL3NwGB2yAxWPU4gaCyaGw%3D%3D&trackingId=f8HcJ62J0wfM9R1si37%2BeQ%3D%3D&position=1&pageNum=1"},{"company":"Njia Hub","company_logo":"","company_url":"","description":"Yesterday\nN\nReact Native Mobile developer\nNjia Hub\nRest of Nigeria (Nationwide)\nConfidential\nMinimum Qualification :\nJob Description/Requirements\n\nAbout Us\n\nNjiaHub is on a mission to empower consumers in Nigeria with the tools to make informed purchasing decisions. As we launch our first flagship project Maoni, we’re looking for a highly skilled Mid Level Full Stack Engineer with a strong focus on front-end development to join our dynamic team.\n\nThis role demands expertise in JavaScript, React Native, and Expo. Backend development using Golang is a big Bonus. The ideal candidate is a team player with a passion for building scalable, user-centric applications and the ability to collaborate across multiple time zones.\n\nKey Responsibilities\n\nFront-End Development:\nDesign and development of responsive, cross-platform mobile applications using TypeScript, React Native, and Expo.\nEnsure a seamless user experience through high-quality UI/UX implementation.\nCollaborate with senior engineers and design teams to translate wireframes and mockups into functional applications.\n\nCollaboration & Communication:\nWork closely with cross-functional teams, including designers, product managers, and other engineers .\nCollaborate effectively across time zones, ensuring timely progress and delivery.\nParticipate in code reviews, mentoring, and knowledge sharing.\nDevOps & Deployment:\nContribute to CI/CD pipelines and ensure smooth deployment processes.\nMonitor and troubleshoot issues in production environments.\n\nRequirementsTechnical Skills:\n\nMinimum of 5 years experience in mobile development.\nExpert-level experience with React Native CLI and Expo.\nProficiency in JavaScript/TypeScript and modern front-end workflows.\nExperience with mobile app optimization for performance and responsiveness.\nExperience with RESTful APIs, GraphQL, and database systems (e.g., PostgreSQL, MongoDB).\n\nOther Requirements:\n\nProven track record of delivering high-quality, scalable applications.\nExcellent problem-solving and debugging skills.\nStrong written and verbal communication skills to work effectively across time zones.\nAbility to manage competing priorities and deliver on deadlines.\n\nNice-to-Haves\n\nFamiliarity with performance monitoring tools like Sentry, New Relic, or similar.\nExperience working in startup environments.\nGolang\nKnowledge of mobile-specific challenges such as battery optimization and push notifications.\n\nWhat We Offer\n\nCompetitive salary and benefits. N300k - N500K\nFlexible working hours and a fully remote environment.\nOpportunity to shape the future of a fast-growing app with a meaningful mission.\nA supportive and collaborative team that values innovation and growth.\n\nReady to Join Us?\n\nIf you’re excited about building impactful technology that shapes consumer experiences, we’d love to hear from you! and become part of Maoni App’s journey.\n\n<","id":"f514373c-246b-45c9-8bfa-2860253617f7","is_remote":true,"job_id":"c5fa296e8c5d4472","job_type":"","location":"Nigeria","posted_at":"2025-03-26T06:32:22Z","salary":"","source":"apify indeed","title":"React Native Mobile developer","url":"https://ng.indeed.com/viewjob?jk=c5fa296e8c5d4472"},{"company":"Njia Hub","company_logo":"","company_url":"","description":"Today\nN\nSenior FrontEnd / Mobile Developer\nNjia Hub\nRest of Nigeria (Nationwide)\nConfidential\nMinimum Qualification :\nJob Description/Requirements\n\nAbout Us\n\nNjiaHub is on a mission to empower consumers in Nigeria with the tools to make informed purchasing decisions. As we launch our first flagship project Maoni, we’re looking for a highly skilled Mid Level Full Stack Engineer with a strong focus on front-end development to join our dynamic team.\n\nThis role demands expertise in JavaScript, React Native, and Expo. Backend development using Golang is a big Bonus. The ideal candidate is a team player with a passion for building scalable, user-centric applications and the ability to collaborate across multiple time zones.\n\nKey Responsibilities\n\nFront-End Development:\nDesign and development of responsive, cross-platform mobile applications using TypeScript, React Native, and Expo.\nEnsure a seamless user experience through high-quality UI/UX implementation.\nCollaborate with senior engineers and design teams to translate wireframes and mockups into functional applications.\n\nCollaboration & Communication:\nWork closely with cross-functional teams, including designers, product managers, and other engineers .\nCollaborate effectively across time zones, ensuring timely progress and delivery.\nParticipate in code reviews, mentoring, and knowledge sharing.\nDevOps & Deployment:\nContribute to CI/CD pipelines and ensure smooth deployment processes.\nMonitor and troubleshoot issues in production environments.\n\nRequirementsTechnical Skills:\n\nMinimum of 5 years experience in mobile development.\nExpert-level experience with React Native CLI and Expo.\nProficiency in JavaScript/TypeScript and modern front-end workflows.\nExperience with mobile app optimization for performance and responsiveness.\nExperience with RESTful APIs, GraphQL, and database systems (e.g., PostgreSQL, MongoDB).\n\nOther Requirements:\n\nProven track record of delivering high-quality, scalable applications.\nExcellent problem-solving and debugging skills.\nStrong written and verbal communication skills to work effectively across time zones.\nAbility to manage competing priorities and deliver on deadlines.\n\nNice-to-Haves\n\nFamiliarity with performance monitoring tools like Sentry, New Relic, or similar.\nExperience working in startup environments.\nGolang\nKnowledge of mobile-specific challenges such as battery optimization and push notifications.\n\nWhat We Offer\n\nCompetitive salary and benefits. N300k - N500K\nFlexible working hours and a fully remote environment.\nOpportunity to shape the future of a fast-growing app with a meaningful mission.\nA supportive and collaborative team that values innovation and growth.\n\nReady to Join Us?\n\nIf you’re excited about building impactful technology that shapes consumer experiences, we’d love to hear from you! and become part of Maoni App’s journey.\n\n<","id":"686fe170-a376-4644-8205-90ce9892fac1","is_remote":true,"job_id":"748a69af6e0e8bc1","job_type":"","location":"Nigeria","posted_at":"2025-03-25T12:31:43Z","salary":"","source":"apify indeed","title":"Senior FrontEnd / Mobile Developer","url":"https://ng.indeed.com/viewjob?jk=748a69af6e0e8bc1"},{"company":"IDT","company_logo":"https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/128x128/457f7c2b55b616dd7573a5a80bda9f5a","company_url":"","description":"Net2phone is looking for a talented and passionate Senior Full Stack Engineer to join our small, agile R&D team.\nIn this role, you'll have the opportunity to independently or collaboratively develop innovative, next-generation applications using cutting-edge technologies like AI, machine learning, and scalable cloud infrastructure. Each team member plays a critical role in rapidly bringing ideas from concept to market, ensuring solutions are both viable and desirable to our customers.\n\nThis is a genuine greenfield opportunity with ambitious goals, allowing significant individual impact and professional growth.\n\nWe expect you to have:\nExpert-level proficiency in Python.\nGolang might be a benefit.\nDeep expertise with Cloud Infrastructure (AWS, Azure, GCP).\nProven experience designing, deploying, and optimizing large-scale databases.\nIndependent, proactive team player who thrives in both solo and collaborative environments.\nPositive, inspiring personality with a passion for innovation and rapid iteration.\nExceptional communication skills, capable of clearly articulating complex concepts.\nFluent English - C1+.\nAt IDT you will:\nResearch, design, and quickly develop solutions from concept to deployment.\nIndependently determine and implement the most effective technologies and frameworks.\nArchitect and manage robust and scalable cloud infrastructures.\nCollaborate closely with colleagues as needed to deliver impactful results.\nContinuously validate ideas, iterate swiftly, and adapt to ensure successful product-market fit.\nWe are pleased to offer:\nRemote work opportunity!\nB2B Employment ($, gross).\nReally good hardware.\nAn exciting and challenging job with talented people around.\nMaximizing your creativity to its fullest potential.\nGreat learning and growth opportunities.\nCompensation for professional training, seminars, and conferences.\nA few words about us:\n\nIDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues.\n\nWe are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.\n\nNet2Phone is a rapidly growing global provider of unified cloud communications solutions. It solves the problem of cost optimization for businesses in more than 50 countries, providing them with high-quality VoIP services. Net2Phone provides businesses with an integrated communications suite featuring powerful collaboration tools such as voice, messaging, chat, and unlimited domestic and international calling to 23+ countries.\nThe product was named ‘VoIP Supplier of the Year’ by the Telecom Consulting Group in 2018.","id":"506aa672-dec5-4078-8c54-79840113a745","is_remote":true,"job_id":"a55ab6085dc70d6a","job_type":"","location":"Plateau","posted_at":"2025-03-13T18:14:33Z","salary":"","source":"apify indeed","title":"Senior Full-stack R&D Developer (Python)","url":"https://ng.indeed.com/viewjob?jk=a55ab6085dc70d6a"},{"company":"eHealth Africa","company_logo":"https://media.licdn.com/dms/image/v2/C4D0BAQHqqIr_-FxI-g/company-logo_100_100/company-logo_100_100/0/1638532046302/ehealth__information_systems_nigeria_logo?e=2147483647&v=beta&t=Itd4Ox9lyYkAItfoFEXYrfD9fKeIqik4bwqQSUJbpKg","company_url":"http://ehealthafrica.org/","description":"Never Miss a Job Update Again.  We have started building our professional LinkedIn page. Company: Location: NigeriaState: Job type: Full-Time Job category: eHealth Africa designs and implements data-driven solutions and technologies to improve health systems for and with local communities. eHA’s technology works in low connectivity settings and uses data to drive decision-making by local governments and partner agencies to get optimum results.We Are Recruiting To Fill The Position BelowJob Title: Lead Engineer – Front-end and Back-endLocation: AbujaEmployment Type: Full-timePurpose of the positionThe Global Health Monitoring (GHM) unit at eHA focuses on innovative solutions like remote temperature monitoring devices to transform cold chain management. This aligns with eHA’s mission to build stronger health systems.The Lead Engineer manages both front-end and back-end development for eHA’s Global Health Monitoring program.This role ensures seamless integration and execution across platform features, APIs, and hardware solutions.Working collaboratively with cross-functional teams in a fast-paced environment, the engineer drives efficient processes, ownership, and growth while supporting eHealth Africa’s mission to improve public health outcomes.What You’ll DoTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Other duties may be assigned:Front EndDesign and develop web features across Parsyl’s software and data platform, assessing user needs and technical requirements from inception to production.Collaborate with engineers, the CTO, product teams, customer success, and business stakeholders to keep the team informed of evolving outputs.Provide guidance to ensure the service/program adapts effectively, strengthening partnerships and deepening relationships with clients and collaborators.Utilize tools and methodologies that sustain eHA delivery standards, demonstrating the effectiveness of new methods to support rapid growth.Back EndDesign and execute API endpoints across the platform, assessing the needs of device and fleet management, sensor data, administration, and data insights.Advise managers and team members on the requirements and expectations for backend architecture development, ensuring alignment of inputs and outcomes. Collaborate with mobile, web, hardware, and data engineering teams, keeping everyone informed of challenges and updatesDesign and manage API documentation, ensuring it evolves to address changing project needs and maintain the quality and clarity of service delivery.OthersAssist in recruiting additional team members to build the engineering team, ensuring timely and coordinated efforts to meet project demands and maintain dynamic growth.Adhere to eHealth Africa Code of Conduct as well as ethical standards of the field.Who You AreFront-End Development: Expertise in building modern web applications with a focus on JavaScript (Vue.js) and UX/UI best practices.Back-End Development: Strong proficiency in Python and Golang, with experience in API-driven architectures.API Design: Ability to design and build scalable APIs that handle high data volumes and are optimized for performance.Cloud Development: Strong understanding of cloud-based development, preferably in AWS (including Lambda, S3, API Gateway, RDS).Software Architecture: Solid understanding of software architecture and backend best practices for scalability and performance.Agile Methodologies: Experience working in Agile environments and adapting to fast-paced development cycles.Problem-Solving &amp; Communication: Strong analytical, organizational, and problem-solving skills, with excellent communication abilities.QualificationsEducation and Experience:8+ years of experience in building web applications, particularly in SaaS and data-intensive environments.Bachelor’s degree in Computer Science, Engineering, or a related field, or equivalent experience.DesirableHardware/Connected Devices: Experience with hardware integration or connected devices.Machine Learning: Familiarity with machine learning applications.B2B Applications: Expertise in building data-intensive B2B applications.Supply Chain &amp; Logistics: Experience in supply chain or logistics or building customer/partner-facing API solutions.Low-Connectivity Environments: Experience developing applications for low-connectivity environments.Additional Technologies: Familiarity with Go, AWS Lambda, S3, Athena, Terraform, Postgres, and Embedded C (not required but beneficial).Application Closing DateNot Specified.Don't Keep! Kindly Share:","id":"aab1c78e-36cb-4dc8-91c5-56eba36a3bd0","is_remote":true,"job_id":"4181366351","job_type":"Full-time","location":"Abuja, Federal Capital Territory, Nigeria","posted_at":"2025-03-13T00:00:00Z","salary":"","source":"apify linkedin","title":"Lead Engineer – Front-end and Back-end at eHealth Systems Africa","url":"https://ng.linkedin.com/jobs/view/lead-engineer-%E2%80%93-front-end-and-back-end-at-ehealth-systems-africa-at-ehealth-africa-4181366351?refId=CL3NwGB2yAxWPU4gaCyaGw%3D%3D&trackingId=ho6s0KMcM1rCuy%2FjkhSoMg%3D%3D&position=2&pageNum=1"},{"company":"Sefara","company_logo":"","company_url":"","description":"*About Us:* We are an early-stage startup building a cutting-edge Sales Copilot designed to automate account research for B2B sales teams. Our platform leverages powerful Large Language Models (LLMs) such as ChatGPT and Anthropic to deliver insightful, accurate, and actionable account intelligence.\n\n*What We're Looking For:* We're seeking a backend Software Engineer who's excited about shaping the core of our platform. While full-stack skills are a plus, your expertise will primarily lie in backend development, infrastructure, database design, and optimizing interactions with LLMs.\n\n*Tech Stack:*\n* Backend: Golang\n* Database: SQL\n* Frontend: TypeScript with React\n* AI/LLMs: ChatGPT, Anthropic, and related APIs\n\n*Responsibilities:*\n* Architect and build scalable backend systems in Golang.\n* Design robust database schemas and queries using SQL.\n* Integrate and optimize Large Language Models for high-quality, reliable outputs.\n* Proactively manage and mitigate common LLM issues such as hallucinations, ensuring accuracy and reliability.\n* Contribute significantly to product design and architecture decisions.\n\n*What You Bring:*\n* Strong backend engineering experience, particularly in Golang and SQL.\n* (Optional) Comfort with React and TypeScript (Frontend skills beneficial but not required).\n* Deep interest or experience in Large Language Models (LLMs) like ChatGPT and Anthropic, with the ability to explain their strengths, weaknesses, and ideal use cases.\n* Critical thinker interested in solving complex AI challenges, particularly related to output quality and hallucination.\n* Exceptional design skills—able to translate complex requirements into clean, maintainable architecture.\n* Passion for reading, staying updated on latest tech developments, and continuous learning.\n\n*Interview Process:*\n* *First Call (1 Hour)*: Introductory conversation followed by a manual coding and design question (no AI assistance).\n* *Second Call (1 Hour)*: Practical demonstration of AI-assisted coding, involving coding/design/database questions, along with a discussion of the limitations and challenges of AI-generated code.\n\n*Compensation:*\n* ₦1,500,000 per month (contract basis), paid twice a month\n* Note: will need to supply own materials\n\n*Location:*\n* Remote - Nigeria\n* We are based in Los Angeles, CA\n\n*Team:*\n* You will be the 2nd engineer hire and should be able to mentor\n\nIf you're eager to build at the intersection of sales intelligence and AI, we'd love to connect!\n\nJob Type: Full-time\n\nPay: ₦1,500,000.00 per month","id":"fcb1d38b-ab75-4cd8-8257-ae01a07e364c","is_remote":true,"job_id":"b918747ad82bc7d6","job_type":"Full-time","location":"Lagos","posted_at":"2025-03-07T01:20:56Z","salary":"₦1,500,000 a month","source":"apify indeed","title":"Senior Software Engineer - Backend","url":"https://ng.indeed.com/viewjob?jk=b918747ad82bc7d6"},{"company":"Skache Integrated Services","company_logo":"","company_url":"","description":"3 weeks ago\nBackend Developer (Go)\nSkache Integrated Services\nSoftware & Data\nLagos Full Time\nBanking, Finance & Insurance NGN 900,000 - 1,200,000\n Easy Apply\nJob Summary\n\nOur client, a foremost MFB is looking for a skilled Backend Developer with expertise in Go (Golang) to join our team. The ideal candidate will have experience in developing banking applications and will be responsible for designing and implementing backend services and APIs for our banking solutions.\n\nMinimum Qualification : Degree\nExperience Level : Mid level\nExperience Length : 4 years\nJob Description/Requirements\n\nResponsibilities:\n\nDesign and implement backend services and APIs using Go (Golang).\nManage databases to ensure efficient and secure data storage and retrieval.\nImplement security best practices to protect sensitive banking data on the backend.\nOptimize backend performance for efficient processing and data handling.\nWork closely with frontend developers to ensure seamless integration between frontend and backend components.\nConduct thorough testing and debugging to ensure the reliability and stability of backend services.\nMaintain clear and comprehensive documentation for the backend code and system architecture.\n\nRequirements:\n\nBachelor’s degree in Computer Science, Information Technology, or a related field.\nMinimum of 3 years of experience in backend development with a focus on Go (Golang).\nProven experience in developing banking applications is required.\nProficiency in Go (Golang), strong understanding of RESTful APIs, database management, and security best practices.\nRelevant certifications in Go or banking application development are a plus.\nMeticulous attention to detail to ensure the quality and security of backend services.\nStrong problem-solving skills to address technical challenges and find effective solutions.\nAbility to work effectively in a team environment and collaborate with colleagues across different departments.\n\nOnly shortlisted candidates will be contacted","id":"13e16b1f-be45-4fa8-9b67-68e300c05704","is_remote":false,"job_id":"6c9d0161b47818ca","job_type":"Full-time","location":"Lagos","posted_at":"2025-03-03T12:28:06Z","salary":"","source":"apify indeed","title":"Backend Developer (Go)","url":"https://ng.indeed.com/viewjob?jk=6c9d0161b47818ca"},{"company":"On The Spot Development","company_logo":"https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/128x128/0629d75391f28afde95b35143cf22acc","company_url":"https://www.onthespotdev.com","description":"About the Job:\n\nWe’re on the hunt for a talented backend engineer to join the ironSource Exchange R&D team. It’s a chance to work on our core server products, help build cutting-edge tools, and support the Exchange department in staying ahead of the competition while driving revenue growth.\nWhat You’ll Do\nDevelop and maintain large-scale web servers, as well as support our current backend systems.\nBe accountable for your work: from technical design and coding to testing, deploying, maintaining, and documenting.\nCollaborate with Product, DevOps, and DataOps teams.\nActively participate in planning processes and contribute to improving team performance.\nOn Call\nWhat We’re Looking For\n3-5 years of experience as a Golang developer.\nAt least 2 years of hands-on work designing and building large, scalable systems.\nA self-driven, independent worker with a knack for innovation.\nStrong interpersonal and written communication skills.\nFamiliarity with tools like AI agents ChatGPT, Claude, or Copilot for accelerating development, and experience working in agile environments with CI/CD practices.\nComfortable using Linux and the terminal.\nA good understanding of Git workflows.\nExperience working with cloud platforms like AWS.\nBonus Points For\nKnowledge of MySQL/PostgreSQL, Aerospike, Redis, or working with large datasets.\nExperience building and managing data pipelines.\nAwareness of how cloud costs impact design and development.\nBenefits\nWork in a highly professional team. Informal and friendly atmosphere in the team.\nAbility to work from our comfortable downtown office in Warsaw\nPaid vacation — 20 business days per year, 100% sick leave payment\n3 additional Friday-days off (U days) during the year\n5 sick days per year\nEquipment provision\nMedical insurance (after the end of the probationary period)\nPartially compensated educational costs (for courses, certifications, professional events, etc.)\nInflation-protected wages with regular revision of compensation conditions\nEnglish and Polish courses — 2 times a week\nBright and memorable corporate life: corporate parties 2 times a year, gifts to employees in honor of life events","id":"a47b02c4-db75-4c33-8fd5-1506615dedf6","is_remote":false,"job_id":"d76526d762e330de","job_type":"","location":"Plateau","posted_at":"2025-02-17T18:27:16Z","salary":"","source":"apify indeed","title":"Senior Go Engineer at Unity","url":"https://ng.indeed.com/viewjob?jk=d76526d762e330de"},{"company":"Youverify","company_logo":"https://media.licdn.com/dms/image/v2/C4D0BAQErSq2iv0L-EQ/company-logo_100_100/company-logo_100_100/0/1630493104071/youcheckonline_logo?e=2147483647&v=beta&t=XBWd4nB3ae1t6JUGLsz8lq4ZtnkPU9mRY6Wb7eU97L0","company_url":"http://www.youverify.co","description":"Never Miss a Job Update Again.  We have started building our professional LinkedIn page. Company: Location: NigeriaState: Job type: Full-Time Job category: Youverify is a leading provider of digital identity management and supports innovative Private security companies, Government agencies, FinTech companies, and top tier banks to manage KYC, and AML in a safe and regulatory compliant manner.Youverify’s mission is to be the most reliable source of identity, address and background data verification. Since being peer-selected by cohort members of Village Capital PayPal Fintech 2018, Youverify has continued to shift the verification landscape with our product offerings. As a company that provides modern and compliant identity and address verification services for government, global enterprises and start-ups, Youverify know first-hand how difficult it may be for businesses to verify the identity of their customers, staff and partners and we want to help to make this process as simple and easy as possible. This is a unique opportunity to work in a fast-growing and product-driven environment using new technologies and frameworks as we continue building our identity verification solution.We Are Recruiting To Fill The Position BelowJob Title: Engineering ManagerLocation: LagosJob SummaryWe are looking for an Engineering Manager with many years of engineering experience and proven leadership skills to join the Technology team to build the next-generation applications to solve complex problems and work with a world-class engineering and product team to deliver innovative products for our users.Engineering managers can expect to work on many projects at the same time, build and manage diverse teams of engineers from different disciplines, formulate and execute strategies, and coordinate with other managers.Their responsibilities usually include researching and developing new designs and products, proposing budgets for projects, and overseeing all the activities related to each project.To be successful as an engineering manager, you should have exceptional foresight, great communication skills, working knowledge of different engineering disciplines and how they relate to one another, and an aptitude for managing risk.Ideally, candidates will have proof of their supervisory and technical skills, and an appreciation for the complex nature of the industry.Job DescriptionProposing and managing budgets for projects.Supervising the work of multiple teams.Planning and executing strategies for completing projects on time.Researching and developing designs and products.Determining the need for training and talent development.Hiring contractors and building teams.Ensuring products have the support of upper management.Providing clear and concise instructions to engineering teams.Design, innovate and solve complex problems inherent in operating a high scale classifieds platform.Play a key role in reviewing and approving the work of your peers as part of the software development process.Interacting with product owners, partners and business stakeholders to understand and develop requirementsDebugging and Improvement of existing systems.Expand our micro-services architecture.RequirementsBachelor’s Degree or Master’s Degree in Computer Science, Mathematics, Electrical Engineering or related fieldsMany years of engineering experience.Experience working with NodeJS/GoLang/JavaProven supervisory and technical skills.Must come highly recommended.Comfort working within agile methodologies and experience in estimation and time managementUnderstanding of unit and integration testing, and testing frameworks/libraries — Mocha, Jest etcStrong preference for test-driven-development (TDD) and understanding its importanceExperience having worked with at least one Web Framework for your language of choiceFamiliarity with at least one web server technology — (ex: Apache, Nginx)Working knowledge of at least one CI/CD tool — Jenkins, Travis CI, Circle CI, GitHub ActionWorking knowledge of gRPC and protocol buffersStrong ability to problem-solve, debug, and understand pertinent performance metricsFamiliarity with containerization infrastructure (Docker), Caching (Redis), API gateway (KrakenD), orchestration (Kubernetes), Distributed tracing (Jaeger), Service mesh (LinkerD) and observabilityKnowledge of microservices (or SOA), Docker, and/or distributed systems.Good working knowledge of NoSQL systems (MongoDB, Elastic, Cassandra), Relational Database Systems (MySQL, PostgreSQL, or Oracle), Messaging Systems (RabbitMQ), KafkaExperience with managing and deploying applications on AWS/DigitalOcean/GCP.Application Closing Date30th May, 2022.Don't Keep! Kindly Share:","id":"5b8ee098-9a8a-4684-bd37-84293fdc4b8a","is_remote":false,"job_id":"4166244700","job_type":"Full-time","location":"Lagos, Lagos State, Nigeria","posted_at":"2025-02-02T00:00:00Z","salary":"","source":"apify linkedin","title":"Engineering Manager at Youverify","url":"https://ng.linkedin.com/jobs/view/engineering-manager-at-youverify-at-youverify-4166244700?refId=B6eGPcH6aZt11r1AxzcNTQ%3D%3D&trackingId=9fMfDaGImLQFKWu7nfBdIg%3D%3D&position=7&pageNum=0"},{"company":"BFREE","company_logo":"https://media.licdn.com/dms/image/v2/C4D0BAQHtPCP8ijQilw/company-logo_100_100/company-logo_100_100/0/1631272070364/bfree_africa_logo?e=2147483647&v=beta&t=XibUXWPHv4mO-w3ngIifcHwjVgJwfLiGcKDeE9qhr10","company_url":"https://bfree.io/","description":"Never Miss a Job Update Again.  We have started building our professional LinkedIn page. Company: Location: NigeriaState: Job type: Full-Time Job category: BFREE Africa is a young, innovative and Nigeria’s foremost ethical debt collection startup. If you want to have fun while working in a fun environment, earn very well when you perform like a rock-star, and be part of a company where your voice matters, then Bfree is the place for you. Because we hate status-quo and we hate mediocre – we founded BFREE to revolutionize debt recovery in NigeriaWe Are Recruiting To Fill The Position BelowJob Title: Golang Backend EngineerLocation: LagosEmployment Type: Full-timeJob DescriptionAs the Backend Engineer at BFREE, you will be a crucial part of our technology team, responsible for designing, developing, and maintaining the backend systems that power our revolutionary financial platform.Reporting directly to the CTO, you will play a pivotal role in ensuring the seamless integration of technology with finance.The ideal candidate will have a strong background in backend development, excellent problem-solving skills, and a passion for driving technological innovation.ResponsibilitiesDesign, develop, and maintain scalable and efficient backend systems to support BFREE’s financial operations across multiple countries and markets.Collaborate with cross-functional teams to understand business requirements and translate them into technical solutions.Implement and optimize APIs, databases, and other backend components to enhance system performance.Work closely with the technology leadership team to align technology initiatives with the company’s overall goals and objectives.Stay abreast of industry trends, emerging technologies, and best practices in backend development.Should possess the ability to identify the most efficient solution and demonstrate proactive initiative.Must demonstrate the ability to communicate effectively with other members of the development teamQualificationsProven experience in a Backend Engineering role, preferably in the fintech or banking sector.At least 3 years of experience as a software engineerStrong backend experience in developing APIs that can efficiently handle large amounts of requests and data using GolangMust have written GO in production for at least 1-2 yearsExperience working with Docker, AWS, and cloud native technologiesExcellent communication and interpersonal skills.Experience with database design and optimization, and microservices architecture.Exceptional problem-solving skills and the ability to work collaboratively in a dynamic environment.Proficient understanding of security best practices in backend development.Ability to adapt to changing priorities and thrive in a fast-paced environment.Application Closing DateNot Specified.Don't Keep! Kindly Share:","id":"28cf690b-1bc6-4ff5-9894-cc2a7dba8ce0","is_remote":false,"job_id":"4166237873","job_type":"Full-time","location":"Lagos, Lagos State, Nigeria","posted_at":"2025-02-02T00:00:00Z","salary":"","source":"apify linkedin","title":"Golang Backend Engineer at BFREE Africa","url":"https://ng.linkedin.com/jobs/view/golang-backend-engineer-at-bfree-africa-at-bfree-4166237873?refId=B6eGPcH6aZt11r1AxzcNTQ%3D%3D&trackingId=luziVD1Hh1yYRT09d2vE4A%3D%3D&position=1&pageNum=0"},{"company":"Indicina","company_logo":"https://media.licdn.com/dms/image/v2/C560BAQHqzVkxdR4N5A/company-logo_100_100/company-logo_100_100/0/1630634223558/indicina_africa_logo?e=2147483647&v=beta&t=d2YhByn0BO7yQoGxPjlnW2e6ZlhDLR02EwO9InwlVm0","company_url":"https://www.indicina.co","description":"Never Miss a Job Update Again.  We have started building our professional LinkedIn page. Company: Location: NigeriaState: Job type: Internship Job category: Indicina Technologies Limited – Only 11% of Africa’s population have their credit information recorded by private credit bureaus vs 17% in Emerging Asia and 79% in Latin America. This, along with other challenges, puts a major brake on consumer lending in Africa.Indicina is building the technology infrastructure that will power the next generation of consumer credit platforms and businesses. We genuinely believe that risk innovation can unlock the massive African consumer credit opportunity.We Are Recruiting To Fill The Position BelowJob Title: Software Engineer InternLocation: NigeriaEmployment Type: Full-timeAbout The RoleIndicina’s Engineering Team is charged with executing the products that help drive our vision.Today, we are scaling the number of businesses that rely on our products while growing the number of features, integrations and client use cases.To be successful as a Software Engineer Intern, you should have a working knowledge of software development.Ultimately, the Software Engineer Intern should be result-driven, have good communication skills, and have up-to-date knowledge of software programming.Core ResponsibilitiesSupporting the software engineers with the design implementation and shadowing their duties to understand the processes more effectively.Developing applications(coding, programming)Debugging and testing codeDocumenting and testing new software application sResearching, investigating and fixing a wide range of technical issuesCollaborating with senior leadersApproaching problems and creating solutionsProactively learning about new technologiesQualificationsInterested candidates should possess relevant qualificationsAt least 1 year of experience writing code.Familiarity with one of the following programming languages: typescript, python, PHP, Golang.Familiarity with MySQL is a plus.Experience with Docker, Gitlab CI, and Bitbucket CI is a plus.Ability to work in a fast-paced environment with minimal supervision.Sense of ownership and pride in your performance and its impact on the company’s success.Critical thinking and problem-solving skills.Team player.Good time-management skills.Application Closing DateNot Specified.Don't Keep! Kindly Share:","id":"cc66f9a3-2300-4109-b0c7-a43a9923d8cb","is_remote":false,"job_id":"4166244563","job_type":"Internship","location":"Nigeria","posted_at":"2025-02-02T00:00:00Z","salary":"","source":"apify linkedin","title":"Software Engineer Intern at Indicina Technologies Limited","url":"https://ng.linkedin.com/jobs/view/software-engineer-intern-at-indicina-technologies-limited-at-indicina-4166244563?refId=B6eGPcH6aZt11r1AxzcNTQ%3D%3D&trackingId=as8JQqAdnQHcbb8I9ccd5A%3D%3D&position=2&pageNum=0"},{"company":"Factory","company_logo":"https://media.licdn.com/dms/image/v2/D4E0BAQHDLPmqrFfgHQ/company-logo_100_100/company-logo_100_100/0/1699526913352/factory_fr_logo?e=2147483647&v=beta&t=nqnnYUqx8wa1VqgwOb7XUxC9C2r5wg87NVQ-OwNkgJg","company_url":"http://www.factory.fr/","description":"Never Miss a Job Update Again.  We have started building our professional LinkedIn page. Company: Location: NigeriaState: Job type: Full-Time Job category: Factory Irisii is a full-cycle web and mobile app development provider for technology companies and startups based in the US, Canada, Australia, UK and others. Our technology tool covers React, Vue, Node, Golang, PHP, Cloud platforms and a comprehensive range of other technologies from Microsoft, Amazon, Google and other web and mobile app development tooling providersWe Are Recruiting To Fill The Position BelowJob Title: Senior DeveloperLocation: Abuja (FCT)Employment Type: Full-timeJob DescriptionWe are looking for a senior React / Node Developer who will participate in the creation and delivery of cloud-based software for web applications, consume and integrate REST APIs, and aid in the development of user interfaces and application design.Your primary focus will be on developing user interface components and implementing them following well-known React.js workflows (such as Flux or Redux).You will ensure that these components and the overall application are robust and easy to maintain.You will coordinate with the junior development team working on different layers of the infrastructure.Therefore, a commitment to collaborative problem solving, sophisticated design, and quality products are important.ResponsibilitiesUnder the supervision of the Project Manager at Factory Irisii, the duties of the Senior Developer may include, but not be limited to:Developing new user-facing features using React.jsWork with the development team and product owner to ideate software solutionsBuilding reusable components and front-end libraries for future useTranslating designs and wireframes into high-quality codeOptimizing components for maximum performance across a vast array of web-capable devices and browsersCollaborate in a team to maintain and improve existing softwareCreate and maintain clean, reusable code.Troubleshooting, debugging and upgrading software.Work with REST APIs for web application developmentAid in the growth and development of junior engineersWork with React.js, Redux, Node.js, GraphQL, RESTful APIs, JavaScript, TypeScriptSkillsStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object modelThorough understanding of React.js and its core principlesExperience with popular React.js workflows (such as Flux or Redux)Familiarity with newer specifications of EcmaScriptExperience with data structure libraries (e.g., Immutable.js)Knowledge of isomorphic React is a plusFamiliarity with RESTful APIsKnowledge of modern authorization mechanisms, such as JSON Web TokenFamiliarity with modern front-end build pipelines and toolsExperience with common front-end development tools such as Babel, Webpack, NPM, etc.Ability to understand business requirements and translate them into technical requirementsA knack for benchmarking and optimizationFamiliarity with code versioning tools such as GitQualificationsCandidates should possess a Bachelor’s Degree, Master Degree, B.Eng, B.Tech4+ years of experience in software development3+ years utilizing a JavaScript framework: React, Next, Nest Ts.ed, React Native etc.Must have a familiarity with at least one: Redux, GraphQL, Node.js, Express, Apollo,Should have familiarity with at least one Cloud technology. GCP, Azure, AWS, Firebase or similar.Knowledge in databases, one or more of the following Sql (Postgress, Mysql), NoSql (Mongodb) , Knowledge of Elastic search is an added advantage.Application Closing Date3rd March, 2022.Don't Keep! Kindly Share:","id":"3349fabc-c067-45b3-bdd5-4d8e73b5dbd6","is_remote":false,"job_id":"4166245480","job_type":"Full-time","location":"Abuja, Federal Capital Territory, Nigeria","posted_at":"2025-02-02T00:00:00Z","salary":"","source":"apify linkedin","title":"Senior Developer at Factory Irisii","url":"https://ng.linkedin.com/jobs/view/senior-developer-at-factory-irisii-at-factory-4166245480?refId=qB0ksxJvVw0%2BqS57F75sFQ%3D%3D&trackingId=OhIligeRfFWTCivWrht%2F7A%3D%3D&position=1&pageNum=1"},{"company":"Factory","company_logo":"https://media.licdn.com/dms/image/v2/D4E0BAQHDLPmqrFfgHQ/company-logo_100_100/company-logo_100_100/0/1699526913352/factory_fr_logo?e=2147483647&v=beta&t=nqnnYUqx8wa1VqgwOb7XUxC9C2r5wg87NVQ-OwNkgJg","company_url":"http://www.factory.fr/","description":"Never Miss a Job Update Again.  We have started building our professional LinkedIn page. Company: Location: NigeriaState: Job type: Full-Time Job category: Factory Irisii is a full-cycle web and mobile app development provider for technology companies and startups based in the US, Canada, Australia, UK and others. Our technology tool covers React, Vue, Node, Golang, PHP, Cloud platforms and a comprehensive range of other technologies from Microsoft, Amazon, Google and other web and mobile app development tooling providersWe Are Recruiting To Fill The Position BelowJob Title: Senior DeveloperLocation: Abuja (FCT)Employment Type: Full-timeJob DescriptionWe are looking for a senior React / Node Developer who will participate in the creation and delivery of cloud-based software for web applications, consume and integrate REST APIs, and aid in the development of user interfaces and application design.Your primary focus will be on developing user interface components and implementing them following well-known React.js workflows (such as Flux or Redux).You will ensure that these components and the overall application are robust and easy to maintain.You will coordinate with the junior development team working on different layers of the infrastructure.Therefore, a commitment to collaborative problem solving, sophisticated design, and quality products are important.ResponsibilitiesUnder the supervision of the Project Manager at Factory Irisii, the duties of the Senior Developer may include, but not be limited to:Developing new user-facing features using React.jsWork with the development team and product owner to ideate software solutionsBuilding reusable components and front-end libraries for future useTranslating designs and wireframes into high-quality codeOptimizing components for maximum performance across a vast array of web-capable devices and browsersCollaborate in a team to maintain and improve existing softwareCreate and maintain clean, reusable code.Troubleshooting, debugging and upgrading software.Work with REST APIs for web application developmentAid in the growth and development of junior engineersWork with React.js, Redux, Node.js, GraphQL, RESTful APIs, JavaScript, TypeScriptSkillsStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object modelThorough understanding of React.js and its core principlesExperience with popular React.js workflows (such as Flux or Redux)Familiarity with newer specifications of EcmaScriptExperience with data structure libraries (e.g., Immutable.js)Knowledge of isomorphic React is a plusFamiliarity with RESTful APIsKnowledge of modern authorization mechanisms, such as JSON Web TokenFamiliarity with modern front-end build pipelines and toolsExperience with common front-end development tools such as Babel, Webpack, NPM, etc.Ability to understand business requirements and translate them into technical requirementsA knack for benchmarking and optimizationFamiliarity with code versioning tools such as GitQualificationsCandidates should possess a Bachelor’s Degree, Master Degree, B.Eng, B.Tech4+ years of experience in software development3+ years utilizing a JavaScript framework: React, Next, Nest Ts.ed, React Native etc.Must have a familiarity with at least one: Redux, GraphQL, Node.js, Express, Apollo,Should have familiarity with at least one Cloud technology. GCP, Azure, AWS, Firebase or similar.Knowledge in databases, one or more of the following Sql (Postgress, Mysql), NoSql (Mongodb) , Knowledge of Elastic search is an added advantage.Application Closing Date3rd March, 2022.Don't Keep! Kindly Share:","id":"16c2f4c4-065f-49b7-a049-3244af0ef2f9","is_remote":false,"job_id":"4166245480","job_type":"Full-time","location":"Abuja, Federal Capital Territory, Nigeria","posted_at":"2025-02-02T00:00:00Z","salary":"","source":"apify linkedin","title":"Senior Developer at Factory Irisii","url":"https://ng.linkedin.com/jobs/view/senior-developer-at-factory-irisii-at-factory-4166245480?refId=B6eGPcH6aZt11r1AxzcNTQ%3D%3D&trackingId=YijlMkVOYzCHnZT4dEC1%2Fg%3D%3D&position=25&pageNum=0"},{"company":"Code For Africa (CfA)","company_logo":"https://media.licdn.com/dms/image/v2/D4D0BAQE93sFKGplDcw/company-logo_100_100/company-logo_100_100/0/1715936226707/code_for_africa_logo?e=2147483647&v=beta&t=4_ukHKHL-h5Pfb-JZggAPuqwzf-Ln2oIzJuqRgz6yW0","company_url":"https://za.linkedin.com/company/code-for-africa?trk=public_jobs_jserp-result_job-search-card-subtitle","description":"Never Miss a Job Update Again.  We have started building our professional LinkedIn page. Company: Location: NigeriaState: Job type: Full-Time Job category: Code for Africa is the continent’s largest federation of independent civic technology and data journalism laboratories, which build digital democracy solutions giving citizens unfettered access to actionable information that empowers them to make informed decisions and that strengthen civic engagement for improved public governance and accountability.We Are Recruiting To Fill The Position BelowJob Title: Site Reliability EngineerLocation: RemoteAbout The RoleDo you want to help run digital infrastructures and tools that strengthen our democracies and empower citizens?Code for Africa (CfA) has an immediate vacancy for a Site Reliability / DevOps Engineer to join our civic technology lab.Candidates must have demonstrable experience in building tools to automate and streamline deployment processes, as well as in maintaining and troubleshooting production systems running on at least one Infrastructure as a Service (IaaS) provider.CfA is a non-profit advocate for open source software (along with open data), and the successful candidate will therefore be required to help champion these principles by adopting best practices and helping document all our technologies to help others reuse it free of charge. Also in keeping with CfA’s values, you will be expected to regularly interact with the wider civic tech community, as well as CfA’s grantees and partners, to share insights and offer guidance.The successful candidates will work as part of a multinational and multilingual team using digital collaboration tools to create content for a global audience and international media partners.The successful candidate will join CfA’s Technology team as a Site Reliability / DevOps Engineer.The technology team is responsible for designing, developing, deploying and maintaining all digital services (tools/systems/platforms) at CfA.You will be responsible for keeping all customer-facing services and other production systems running smoothly. This will include protecting the health of the production environment by, for example, planning and testing disaster recovery scenarios for our highly available tools/systems/platforms.Additionally, you will support the development team with an agile, responsive continuous integration and continuous delivery (CI/CD) platform to deliver high-quality builds with measurable performance and quality.Key ResponsibilitiesDesign, write and deliver software to improve all aspects of our deployment process i.e. infrastructure-as-codeDebug production issues across all our services.Analyse data and provide operational insights into service reliability and user experience to Design and Development teams.Plan the growth of Code for Africa’s infrastructure.Writing technical documents.RequirementsMinimum requirements include:Bachelor’s Degree in Computer Science or equivalent Engineering discipline2+ years as Site Reliability/DevOps Engineer working with AWS.1+ year development experience in Python, JavaScript, Go, or related languages.Strong Linux troubleshooting knowledge.Excellent verbal and written communication skills.PreferredCandidates who are able to demonstrate the following will have an advantage:Good to advanced knowledge of TCP/IP networking &amp; troubleshooting tools.Experience with Docker, Nginx, Dokku, GitHub Actions, or similar technologies.Ability to dive deep into complex technical problems.Language and Location Requirements:Location: CfA has labs located in Kenya, Nigeria, Senegal, South Africa, Tanzania and Uganda. However the role can be performed remotely, and applicants across Africa will therefore be considered.Languages: EnglishPreferred but not required: Arabic, French, KiSwahili or any other major language spoken in Africa.What We OfferA competitive salary, subject to experience, with opportunities for performance-based growth, both in terms of career path and public stature.A dynamic workplace, with a transnational team, occasional international travel, and generous vacation benefits.Ongoing opportunities to learn new cutting-edge skills and techniques/technologies to future-proof yourself in a rapidly evolving industry.A chance to shine on a global stage, writing for international audiences and interacting with colleagues around the world.Application Closing Date30th April, 2022.Don't Keep! Kindly Share:","id":"a4a4a065-18aa-439c-813b-8b27909a3b8e","is_remote":true,"job_id":"4163577891","job_type":"Full-time","location":"Nigeria","posted_at":"2025-01-31T00:00:00Z","salary":"","source":"apify linkedin","title":"Site Reliability Engineer (Remote) at Code for Africa (CfA)","url":"https://ng.linkedin.com/jobs/view/site-reliability-engineer-remote-at-code-for-africa-cfa-at-code-for-africa-cfa-4163577891?refId=B6eGPcH6aZt11r1AxzcNTQ%3D%3D&trackingId=VZ36nmn56gA0ZK5MpyfPCg%3D%3D&position=10&pageNum=0"},{"company":"Insight7","company_logo":"","company_url":"","description":"Insight7 is hiring on behalf of Pika Group UK. Pika Group UK builds platforms for the gig economy and we are looking for a motivated senior back-end developer to join our innovative full-stack engineering team. Your skills should be more than about speed. We are looking for someone who is strategic and can think through the overall design to anticipate future needs.\n\nOur platform provides real-time insights to business professionals such as product managers, designers, and marketers through an easy-to-use web interface.\n\nWorking at Pika Group UK will give you the opportunity to be part of a dynamic and energetic work environment where you can learn a variety of technologies.\n\nREQUIREMENTS & SKILLS:\n* Computer Science, Engineering, or a related major from an accredited institution\n* Minimum of 5 years of experience in back-end development for the web\n* Strong knowledge of an object-oriented language.\n* Creative problem-solver and out-of-the-box thinker\n* Excellent time management, problem-solving, teamwork, and communication skills\n* A desire for continued education and enjoys keeping up with tech industry trends and learning new technologies\n\nEXPERIENCE:\n* A product-minded developer who cares about the \"Why\" - Why build this feature? How will we measure impact?\n* Experience using Golang (Preferred) or technologies and frameworks like (but not limited to) some of the most-used languages — Node.js, PHP, Python, React or React Native, Kubernetes, Java, Ruby.\n* Expertise in front-end technologies, including JavaScript, CSS3 and HTML5 and third-party libraries such as React Js, Typescript, Angular, jQuery and LESS\n* A strong foundation of design principles, especially when it relates to platform development in the areas of API, data modelling, and scale.\n* Basic design ability: Including knowledge of UI/UX and basic prototype design\n* Experience with relational databases and SQL\n* Curiosity and passion to constantly learn new things.\n* Bonus Points: You’ve mentored teammates on new ways to deepen their technical craft\n\nJob Type: Full-time\n\nPay: ₦250,000.00 - ₦400,000.00 per month\n\n\nApplication Deadline: 24/02/2025\nExpected Start Date: 01/03/2025","id":"d2cee469-d02e-4ddc-89d7-df3aa92b43d3","is_remote":false,"job_id":"eff25f007946af39","job_type":"Full-time","location":"Lagos","posted_at":"2025-01-02T16:28:19Z","salary":"₦250,000 - ₦400,000 a month","source":"apify indeed","title":"Senior Full Stack Developer","url":"https://ng.indeed.com/viewjob?jk=eff25f007946af39"},{"company":"Pryme Financials Ltd","company_logo":"","company_url":"","description":"About the company\n\nPryme is a multi-currency fintech platform designed to empower individuals and businesses with seamless, innovative financial solutions for personal and business accounts. We are redefining global banking for a new generation by enabling effortless cross-border transactions, flexible multi-currency management, and tailored financial products that meet the unique needs of our users. At Pryme, our culture is built on four core pillars: Ownership, where every team member takes responsibility for their work and its impact; Taking Steps, encouraging bold and proactive actions toward solving challenges; Collaboration, fostering teamwork and shared successes; and Making Things Happen, delivering results with a relentless focus on execution. By driving global impact while maintaining local relevance, we strive to make banking accessible, efficient, and meaningful for our customers worldwide.\n\nAbout the role\n\nPryme is looking for an experienced Full-Stack Software Engineer proficient in Golang for backend development and JavaScript (NuxtJS) for frontend work. This role will focus on developing efficient, scalable web applications, managing data flow, and ensuring optimal performance through caching and event-driven systems.\n\nResponsibilities\n\nDevelop and maintain backend services and APIs using Golang.\nBuild and maintain responsive, user-centered frontend applications using NuxtJS and Vue.js.\nDesign and implement user interfaces with Tailwind CSS and Bootstrap for a clean, cohesive user experience.\nManage databases (e.g., MySQL, PostgreSQL) and optimize application performance with caching solutions like Redis or Memcached.\nIntegrate event-driven systems such as Kafka to support asynchronous processes and data streaming.\nWork closely with cross-functional teams to design, develop, and deploy new features.\nOptimize applications for performance, scalability, and responsiveness.\nDebug, troubleshoot, and resolve issues across the full stack.\nStay updated on industry best practices, tools, and technologies.\n\nRequirements:\n\nBachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent practical experience).\nProven experience as a Full-Stack Engineer with proficiency in Golang\nStrong experience with JavaScript frameworks, particularly NuxtJS and Vue.js.\nExperience developing SaaS-style applications and/or public APIs.\nHands-on experience with SQL schema design, SOLID principles, REST API design\nProficiency in using version control systems (e.g., Git) and collaboration tools.\nStrong problem-solving and analytical skills, with a keen attention to detail.\nAbility to work effectively both independently and collaboratively within a team.\nExcellent verbal and written communication skills.\nStrong organizational and time management skills, with the ability to prioritize tasks effectively.\nDatabase management experience (e.g., MySQL, PostgreSQL) and proficiency with caching systems like Redis or Memcached.\nExperience with event streaming technologies such as Kafka or similar systems.\nProficiency with version control systems, preferably Git.\nStrong problem-solving abilities and attention to detail.\nExperience in Financial Services is an advantage.\nExperience with other programming languages and technologies, such as Java, Golang, or containerization (e.g., Docker, Kubernetes), is a plus.\n\nWhy Join Us?\n\nBe part of an innovative Fintech transforming the financial landscape for businesses.\nWork in an exciting, growth-focused environment where you can collaborate and contribute meaningfully to sector-specific strategies.\nOpportunity for professional development and career growth\n\nBy submitting this application, I confirm that all the information given by me in this application for employment and any additional documents attached hereto are true to the best of my knowledge and that I have not wilfully suppressed any material fact. I confirm I have disclosed if applicable any previous employment with Pryme Financials Ltd. I accept that if any of the information given by me in this application is in any way false or incorrect, my application may be rejected, any offer of employment may be withdrawn or my employment with Pryme Financials Ltd may be terminated summarily or I may be dismissed. By submitting this application, I agree that my personal data will be processed in accordance with Pryme Financials Ltd's Candidate Privacy Notice","id":"a06a91ac-771d-4fcf-9a56-7db424143351","is_remote":false,"job_id":"ed690ee1001620a4","job_type":"Full-time","location":"Lagos","posted_at":"2024-12-01T16:03:49Z","salary":"","source":"apify indeed","title":"Senior Fullstack Engineer (Golang & NuxtJS)","url":"https://ng.indeed.com/viewjob?jk=ed690ee1001620a4"},{"company":"Pryme","company_logo":"https://media.licdn.com/dms/image/v2/D4E0BAQHmrV4J1rIHxw/company-logo_100_100/company-logo_100_100/0/1718453665025?e=2147483647&v=beta&t=SHwOn4RCCbBUCsYHYUk7Gvkbef0MNHiEZXwgV4iIrds","company_url":"http://www.mypryme.com","description":"About The CompanyPryme is a multi-currency fintech platform designed to empower individuals and businesses with seamless, innovative financial solutions for personal and business accounts. We are redefining global banking for a new generation by enabling effortless cross-border transactions, flexible multi-currency management, and tailored financial products that meet the unique needs of our users. At Pryme, our culture is built on four core pillars: Ownership, where every team member takes responsibility for their work and its impact; Taking Steps, encouraging bold and proactive actions toward solving challenges; Collaboration, fostering teamwork and shared successes; and Making Things Happen, delivering results with a relentless focus on execution. By driving global impact while maintaining local relevance, we strive to make banking accessible, efficient, and meaningful for our customers worldwide.About The RolePryme is looking for an experienced Full-Stack Software Engineer proficient in Golang for backend development and JavaScript (NuxtJS) for frontend work. This role will focus on developing efficient, scalable web applications, managing data flow, and ensuring optimal performance through caching and event-driven systems.ResponsibilitiesDevelop and maintain backend services and APIs using Golang.Build and maintain responsive, user-centered frontend applications using NuxtJS and Vue.js.Design and implement user interfaces with Tailwind CSS and Bootstrap for a clean, cohesive user experience.Manage databases (e.g., MySQL, PostgreSQL) and optimize application performance with caching solutions like Redis or Memcached.Integrate event-driven systems such as Kafka to support asynchronous processes and data streaming.Work closely with cross-functional teams to design, develop, and deploy new features.Optimize applications for performance, scalability, and responsiveness.Debug, troubleshoot, and resolve issues across the full stack.Stay updated on industry best practices, tools, and technologies.RequirementsBachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent practical experience).Proven experience as a Full-Stack Engineer with proficiency in GolangStrong experience with JavaScript frameworks, particularly NuxtJS and Vue.js.Experience developing SaaS-style applications and/or public APIs.Hands-on experience with SQL schema design, SOLID principles, REST API designProficiency in using version control systems (e.g., Git) and collaboration tools.Strong problem-solving and analytical skills, with a keen attention to detail.Ability to work effectively both independently and collaboratively within a team.Excellent verbal and written communication skills.Strong organizational and time management skills, with the ability to prioritize tasks effectively.Database management experience (e.g., MySQL, PostgreSQL) and proficiency with caching systems like Redis or Memcached.Experience with event streaming technologies such as Kafka or similar systems.Proficiency with version control systems, preferably Git.Strong problem-solving abilities and attention to detail.Experience in Financial Services is an advantage.Experience with other programming languages and technologies, such as Java, Golang, or containerization (e.g., Docker, Kubernetes), is a plus.Why Join Us?Be part of an innovative Fintech transforming the financial landscape for businesses.Work in an exciting, growth-focused environment where you can collaborate and contribute meaningfully to sector-specific strategies.Opportunity for professional development and career growthBy submitting this application, I confirm that all the information given by me in this application for employment and any additional documents attached hereto are true to the best of my knowledge and that I have not wilfully suppressed any material fact. I confirm I have disclosed if applicable any previous employment with Pryme Financials Ltd. I accept that if any of the information given by me in this application is in any way false or incorrect, my application may be rejected, any offer of employment may be withdrawn or my employment with Pryme Financials Ltd may be terminated summarily or I may be dismissed. By submitting this application, I agree that my personal data will be processed in accordance with Pryme Financials Ltd's Candidate Privacy Notice","id":"c89a5ae5-6d80-4260-8a59-23ac5bcd40df","is_remote":false,"job_id":"4070147100","job_type":"Full-time","location":"Lagos, Lagos State, Nigeria","posted_at":"2024-11-08T00:00:00Z","salary":"","source":"apify linkedin","title":"Senior Fullstack Engineer (Golang & NuxtJS)","url":"https://ng.linkedin.com/jobs/view/senior-fullstack-engineer-golang-nuxtjs-at-pryme-4070147100?refId=B6eGPcH6aZt11r1AxzcNTQ%3D%3D&trackingId=5%2B5EB9vd8Nciyny0HSwZMw%3D%3D&position=24&pageNum=0"},{"company":"Pryme","company_logo":"https://media.licdn.com/dms/image/v2/D4E0BAQHmrV4J1rIHxw/company-logo_100_100/company-logo_100_100/0/1718453665025?e=2147483647&v=beta&t=SHwOn4RCCbBUCsYHYUk7Gvkbef0MNHiEZXwgV4iIrds","company_url":"http://www.mypryme.com","description":"About The CompanyPryme is a multi-currency fintech platform designed to empower individuals and businesses with seamless, innovative financial solutions for personal and business accounts. We are redefining global banking for a new generation by enabling effortless cross-border transactions, flexible multi-currency management, and tailored financial products that meet the unique needs of our users. At Pryme, our culture is built on four core pillars: Ownership, where every team member takes responsibility for their work and its impact; Taking Steps, encouraging bold and proactive actions toward solving challenges; Collaboration, fostering teamwork and shared successes; and Making Things Happen, delivering results with a relentless focus on execution. By driving global impact while maintaining local relevance, we strive to make banking accessible, efficient, and meaningful for our customers worldwide.About The RolePryme is looking for an experienced Full-Stack Software Engineer with expertise in Java (Spring Boot) for backend development and JavaScript (NuxtJS) for frontend work. The ideal candidate will be skilled in creating secure, scalable, and high-performance applications and have a strong grasp of Spring technologies such as Spring Security, Spring Data, and Spring Cloud for microservices and distributed systems.ResponsibilitiesDevelop and maintain backend services and RESTful APIs using Java and Spring Boot.Secure applications and manage authentication and authorisation with Spring Security.Use Spring Data to handle data persistence and efficiently interact with relational databases.Design, develop, and deploy cloud-native microservices using Spring Cloud (e.g., for service discovery, configuration management, load balancing, etc.).Build responsive, user-centered front-end applications using NuxtJS and Vue.js.Design attractive and functional user interfaces with Tailwind CSS and Bootstrap.Implement and optimise relational databases (e.g., MySQL, PostgreSQL) and caching solutions like Redis or Memcached.Integrate and manage event-driven architectures with Kafka for real-time and asynchronous processing.Collaborate with cross-functional teams to design, develop, and deploy new features.Troubleshoot, debug, and resolve issues across the stack.Stay up-to-date on best practices and advancements in backend and frontend technologies.RequirementsBachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent practical experience).Proven experience in backend development with Java and Spring Boot, including practical knowledge of Spring Security, Spring Data, and Spring Cloud.Strong experience with JavaScript frameworks, particularly NuxtJS and Vue.js.Experience developing SaaS-style applications and/or public APIs.Hands-on experience with SQL schema design, SOLID principles, and REST API designProficiency in using version control systems (e.g., Git) and collaboration tools.Strong problem-solving and analytical skills with a keen attention to detail.Ability to work effectively both independently and collaboratively within a team.Excellent verbal and written communication skills.Strong organisational and time management skills, with the ability to prioritise tasks effectively.Database management experience (e.g., MySQL, PostgreSQL) and proficiency with caching systems like Redis or Memcached.Experience with event streaming technologies such as Kafka or similar systems.Proficiency with version control systems, preferably Git.Strong problem-solving abilities and attention to detail.Experience in Financial Services is an advantage.Experience with other programming languages and technologies, such as Java, Golang, or containerisation (e.g., Docker, Kubernetes), is a plus.Why Join Us?Be part of an innovative Fintech transforming the financial landscape for businesses.Work in an exciting, growth-focused environment where you can collaborate and contribute meaningfully to sector-specific strategies.Opportunity for professional development and career growthRefer to our Data Privacy Statement for Candidates for details on our data handling practices during your application.","id":"a6331209-7830-4781-b55d-b1db6486aad3","is_remote":false,"job_id":"4070143595","job_type":"Full-time","location":"Lagos, Lagos State, Nigeria","posted_at":"2024-11-08T00:00:00Z","salary":"","source":"apify linkedin","title":"Senoir Fullstack Engineer (Java & NuxtJS)","url":"https://ng.linkedin.com/jobs/view/senoir-fullstack-engineer-java-nuxtjs-at-pryme-4070143595?refId=qB0ksxJvVw0%2BqS57F75sFQ%3D%3D&trackingId=niYDYbWM%2BIXSn5BQxZP91g%3D%3D&position=16&pageNum=1"},{"company":"Pryme","company_logo":"https://media.licdn.com/dms/image/v2/D4E0BAQHmrV4J1rIHxw/company-logo_100_100/company-logo_100_100/0/1718453665025?e=2147483647&v=beta&t=SHwOn4RCCbBUCsYHYUk7Gvkbef0MNHiEZXwgV4iIrds","company_url":"http://www.mypryme.com","description":"About The CompanyPryme is a multi-currency fintech platform designed to empower individuals and businesses with seamless, innovative financial solutions for personal and business accounts. We are redefining global banking for a new generation by enabling effortless cross-border transactions, flexible multi-currency management, and tailored financial products that meet the unique needs of our users. At Pryme, our culture is built on four core pillars: Ownership, where every team member takes responsibility for their work and its impact; Taking Steps, encouraging bold and proactive actions toward solving challenges; Collaboration, fostering teamwork and shared successes; and Making Things Happen, delivering results with a relentless focus on execution. By driving global impact while maintaining local relevance, we strive to make banking accessible, efficient, and meaningful for our customers worldwide.About The RolePryme is seeking a skilled and motivated Software Developer to join our dynamic development team. As a Software Developer, you will be responsible for designing, developing, and maintaining high-quality software solutions using Php,Laravel and NuxtJS/VueJs. You will collaborate with cross-functional teams to deliver innovative and scalable software products.ResponsibilitiesDevelop and maintain web applications using PHP/Laravel for backend services and NuxtJS for frontend.Build innovative, state-of-the-art applications and collaborate with the User Interface &amp; Experience (UI/UX) teamDesign user-friendly interfaces with Tailwind CSS and Bootstrap, ensuring responsive design and cross-browser compatibilityWrite clean, efficient, and well-documented code that meets industry standards.Conduct thorough testing and debugging of applications to ensure software quality and performance.Participate in code reviews to provide constructive feedback and ensure adherence to coding best practices.Maintain our web application tech stack: Laravel PHP, NuxtJs, MariaDB, Redis, Kafka, and whatever else is required to complete the job.Troubleshoot and resolve software defects and issues reported by users or discovered during testing.Collaborate with cross-functional teams, including designers, developers, and QA engineers, to deliver high-quality software products within project timelines.Coordinate with co-developers, keep the project manager well informed of the status of the development effort, and serve as a liaison between development staff and the project manager.Contribute to the continuous improvement of development processes and workflows.RequirementsBachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent practical experience).Proven experience as a Full-Stack Engineer with proficiency in PHP (especially Laravel framework).Strong experience with JavaScript frameworks, particularly NuxtJS and Vue.js.Experience developing SaaS-style applications and/or public APIs.Hands-on experience with SQL schema design, SOLID principles, and REST API designProficiency in using version control systems (e.g., Git) and collaboration tools.Strong problem-solving and analytical skills with a keen attention to detail.Ability to work effectively both independently and collaboratively within a team.Excellent verbal and written communication skills.Strong organisational and time management skills, with the ability to prioritise tasks effectively.Database management experience (e.g., MySQL, PostgreSQL) and proficiency with caching systems like Redis or Memcached.Experience with event streaming technologies such as Kafka or similar systems.Proficiency with version control systems, preferably Git.Strong problem-solving abilities and attention to detail.Software testing (PHP Unit, PHP Spec, Behat). MySQL profiling and query optimisationExperience in Financial Services is an advantage.Experience with other programming languages and technologies, such as Java, Golang, or containerisation (e.g., Docker, Kubernetes), is a plus.Why Join Us?Be part of an innovative Fintech transforming the financial landscape for businesses.Work in an exciting, growth-focused environment where you can collaborate and contribute meaningfully to sector-specific strategies.Opportunity for professional development and career growthBy submitting this application, I confirm that all the information given by me in this application for employment and any additional documents attached hereto are true to the best of my knowledge and that I have not wilfully suppressed any material fact. I confirm I have disclosed if applicable any previous employment with Pryme Financials Ltd. I accept that if any of the information given by me in this application is in any way false or incorrect, my application may be rejected, any offer of employment may be withdrawn or my employment with Pryme Financials Ltd may be terminated summarily or I may be dismissed. By submitting this application, I agree that my personal data will be processed in accordance with Pryme Financials Ltd's Candidate Privacy Notice","id":"ebf4e777-693f-43d7-bc88-4f3afd2b6f15","is_remote":false,"job_id":"4070147105","job_type":"Full-time","location":"Lagos, Lagos State, Nigeria","posted_at":"2024-11-07T00:00:00Z","salary":"","source":"apify linkedin","title":"Senior Fullstack Engineer (PHP & NuxtJS)","url":"https://ng.linkedin.com/jobs/view/senior-fullstack-engineer-php-nuxtjs-at-pryme-4070147105?refId=qB0ksxJvVw0%2BqS57F75sFQ%3D%3D&trackingId=gP8lkWzi0CNG36qM3PkWxA%3D%3D&position=23&pageNum=1"},{"company":"PeopleOS","company_logo":"https://cdn.brandfetch.io/id-OrKp-yG/w/199/h/34/theme/dark/logo.png?c=1bxidIPTRtzv36oeM-tGb","company_url":"https://peopleos.co","description":"This is a remote position.\n\nBackend Development\n\n· Design, develop, and maintain backend services using Golang\n\n· Implement RESTful APIs and microservices architecture\n\nDatabase Management\n\n· Work with relational (PostgreSQL, MySQL) and NoSQL (MongoDB, Redis) databases\n\n· Optimize database queries and ensure data integrity\n\nPerformance Optimization\n\n· Write clean, efficient and scalable code\n\n· Analyze and optimize applications for speed, scalability, and performance.\n\n· Improve system performances by profiling and identifying bottlenecks\n\nCollaboration & Documentation\n\n· Work with cross-functional teams (product, design, QA, DevOps) to design new features and enhance existing functionality.\n\n· Create and maintain technical documentation for code, processes, and systems.\n\nTesting & Debugging\n\n· Write unit and integration tests to ensure application stability\n\n· Debug and resolve production issues in a timely manner\n\nCode Quality & Best practices\n\n· Regularly refactor code to improve structure and reduce technical debt\n\n· Follow coding standards and maintain clean, readable, and efficient code\n\nSecurity & Reliability\n\n· Implement authentication, authorization, and security best practices\n\n· Ensure data protection and compliance with industry standards\n\nContinuous Improvement\nStay updated with the latest industry trends, tools, and best practices in software development and Go programming. Requirements 4-5 years experience in Golang with a solid understanding of Go’s best practices. Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent practical experience). Proficiency in building and deploying RESTful APIs and microservices. Strong debugging, testing, and troubleshooting skills. Knowledge of concurrency patterns and multithreading in Go. Familiarity with relational databases (SQL) and NoSQL databases. Experience with version control systems (e.g., Git). Understanding of agile development methodologies. Strong analytical skills with the ability to troubleshoot and resolve issues efficiently. Excellent verbal and written communication skills. Experience with containerization technologies such as Docker and Kubernetes. Familiarity with CI/CD pipelines and automated testing frameworks. Knowledge of cloud platforms (AWS, GCP, Azure).","id":"bfe3a638-689a-4ddc-a577-ac74518f936e","is_remote":false,"job_id":"91946073-3ee2-4e74-ac72-23a09d5758a7","job_type":"Contractor","location":"Lagos","posted_at":"0001-01-01T00:00:00Z","salary":"","source":"jsearch","title":"Backend Golang Developer","url":"https://en-ng.whatjobs.com/gfj/6172940?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"company":"BFREE","company_logo":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRhVIVyTdyL00_UAzF9bOIfoNPg_v-uD17nrPOe&s=0","company_url":"","description":"Never Miss a Job Update Again.\n\nWe have started building our professional LinkedIn page.\n• Company:\n• Location: Nigeria\n• State:\n• Job type: Full-Time\n• Job category:\n\nBFREE Africa is a young, innovative and Nigeria’s foremost ethical debt collection startup. If you want to have fun while working in a fun environment, earn very well when you perform like a rock-star, and be part of a company where your voice matters, then Bfree is the place for you. Because we hate status-quo and we hate mediocre – we founded BFREE to revolutionize debt recovery in Nigeria\n\nWe Are Recruiting To Fill The Position Below\n\nJob Title: Golang Backend Engineer\n\nLocation: Lagos\n\nEmployment Type: Full-time\n\nJob Description\n• As the Backend Engineer at BFREE, you will be a crucial part of our technology team, responsible for designing, developing, and maintaining the backend systems that power our revolutionary financial platform.\n• Reporting directly to the CTO, you will play a pivotal role in ensuring the seamless integration of technology with finance.\n• The ideal candidate will have a strong background in backend development, excellent problem-solving skills, and a passion for driving technological innovation.\n\nResponsibilities\n• Design, develop, and maintain scalable and efficient backend systems to support BFREE’s financial operations across multiple countries and markets.\n• Collaborate with cross-functional teams to understand business requirements and translate them into technical solutions.\n• Implement and optimize APIs, databases, and other backend components to enhance system performance.\n• Work closely with the technology leadership team to align technology initiatives with the company’s overall goals and objectives.\n• Stay abreast of industry trends, emerging technologies, and best practices in backend development.\n• Should possess the ability to identify the most efficient solution and demonstrate proactive initiative.\n• Must demonstrate the ability to communicate effectively with other members of the development team\n\nQualifications\n• Proven experience in a Backend Engineering role, preferably in the fintech or banking sector.\n• At least 3 years of experience as a software engineer\n• Strong backend experience in developing APIs that can efficiently handle large amounts of requests and data using Golang\n• Must have written GO in production for at least 1-2 years\n• Experience working with Docker, AWS, and cloud native technologies\n• Excellent communication and interpersonal skills.\n• Experience with database design and optimization, and microservices architecture.\n• Exceptional problem-solving skills and the ability to work collaboratively in a dynamic environment.\n• Proficient understanding of security best practices in backend development.\n• Ability to adapt to changing priorities and thrive in a fast-paced environment.\n\nApplication Closing Date\n\nNot Specified.\n\nDon't Keep! Kindly Share:\n• *\n•","id":"640a8631-fdd2-4ee3-b14f-6a68e45652c6","is_remote":false,"job_id":"398280c6-8d27-4291-a815-d00c81d3d9e3","job_type":"Full-time","location":"Lagos","posted_at":"0001-01-01T00:00:00Z","salary":"","source":"jsearch","title":"Golang Backend Engineer at BFREE Africa","url":"https://ng.linkedin.com/jobs/view/golang-backend-engineer-at-bfree-africa-at-bfree-4166237873?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"company":"ListingAPI-2","company_logo":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwAYTaqXTFn6sFstWcXn5GdW66TKnQjfWf_DBC&s=0","company_url":"","description":"Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence – in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.\n\nWe are recruiting to fill the position below:\n\nJob Title: Golang Engineering Manager (IAM)\n\nLocation: Lagos\n\nDescription\n• Canonical is seeking experienced Python/Go engineering managers to build highly performant and secure identity and access management solutions that will be used across all company products.\n• From Ubuntu One SSO to Juju, LXD and MAAS your team will define the way Canonical users, clients and community members access their favorite open source applications.\n• This is an opportunity for a software engineering manager with a passion for distributed systems operations to help us transform the future of identity management at Canonical.\n• Experience in the identity and access management (IAM) field is desirable but not required.\n• You will work with upstream open source projects, alongside internal teams to deliver high quality software that can be deployed on bare metal, public cloud and Kubernetes.\n• As the identity team engineering manager you will bring significant software development experience, Kubernetes knowledge and a keen eye for software design, performance and security.\n• You will be responsible for working with product management to define the technical vision for the products, managing the team backlog, reviewing code and coaching younger team members.\n• You will be involved in all the aspects of the software development process: you will design software, write high-quality code and tests, provide insightful code reviews, write documentation and help to troubleshoot issues.\n• In addition to the engineering behind the project itself, you’ll have the chance to work with industry-leading teams inside Canonical, ensuring your work is backed by rock-solid data stores, and highly observable using our Kubernetes-based Observability stack.\n• You’ll work with broader open source communities, participating in “hackfest” events, webinars and conferences.\n\nRequirements\n\nWho you are:\n• Proven experience hiring and leading a high performance software engineering team\n• Expertise in Python and Go software development\n• Ability to design and implement complex, distributed system\n• Experience working with container technology and Kubernetes\n• Strong understanding of software/infrastructure security and performance\n• Experience designing and/or operating large scale distributed systems\n• Knowledge of identity and access management technologies and standards is desirable but not essential\n\nApplication Closing Date\n\nNot Specified.\n\nHow to Apply\n\nInterested and qualified candidates should:\n\nClick here to apply online","id":"e1e41c30-56d3-45e3-a9c1-a00955aa687f","is_remote":false,"job_id":"ed3eefe0-3120-47a5-b8da-bb14d53ffaaa","job_type":"Full-time","location":"Lagos","posted_at":"0001-01-01T00:00:00Z","salary":"","source":"jsearch","title":"Golang Engineering Manager (IAM) at Canonical Nigeria","url":"https://www.myjobally.com/job/golang-engineering-manager-iam-at-canonical-nigeria/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"company":"ListingAPI-2","company_logo":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwAYTaqXTFn6sFstWcXn5GdW66TKnQjfWf_DBC&s=0","company_url":"","description":"Apex Network is a Financial servicing firm, where anyone anywhere can easily and securely transact Bitcoin, which is the future of Money and a catalyst for creating and open financial system in Africa and the World.\n\nWe are recruiting to fill the position below:\n\nJob Title: GO-Lang Backend Developer\n\nLocation: Lekki, Lagos\n\nJob type: Full-Time\n\nDepartment: Information Technology\n\nJob Description\n• We are sourcing for a Golang developer, who will help in building a optimised, scalable, and modular software using required technologies.\n• You will be tasked developing and coding back-end components and connecting applications to other web services.\n\nWhat you will do looks like\n• Structure our user interface with React and ensure REST API access is available for enterprise-grade finance customers on-demand\n• Collaborate with other technical staff to ensure consistent and smooth DevOps workflows.\n• Choose and implement other libraries that will optimise performance without sacrificing security and base functionality\n• Manage multiple projects within reasonable design specifications and budget restrictions\n• QA design for errors\n• Implement feedback and changes whenever possible\n• Create visualisation that convey accurate messaging for the project.\n• Writing scalable, robust,, testable, efficient, and easily maintainable code\n• Translating software requirements into stable, working, high performance software\n• Playing a key role in architectural and design decisions, building toward an efficient micro services distributed architecture.\n\nWhat you should have looks like\n• Minimum of two years experience working in programming or information technology\n• Excellent written and verbal communication skills\n• Attention to detail..\n• Strong knowledge of Go programming language, paradigms, constructs, and idioms\n• Knowledge of common Goroutine and channel patterns\n• Experience with the full site of Go frameworks and tools, including:\n• Dependency management tools such as Godep, Sltr, etc.\n• Go’s templating language\n• Go’s code generation tools, such as Stringer\n• Popular Go web frameworks, such as Revel\n• Router packages, such as Gorilla Mux\n• Ability to write clean and effective Godoc comments\n• Other programming language experience such as ( LARAVEL, JAVASCRIPT etcetera.)\n• Strong analytical skills\n• Time management and organisational skills\n• Knowledge of Go templating, common frameworks, and tools\n• Experience working with a team.\n\nApplication Closing Date\n\nNot Specified.\n\nHow to Apply\n\nInterested and qualified candidates should:\n\nClick here to apply online","id":"2f7c0fc3-8fda-46c6-b7a5-3952628cd63f","is_remote":false,"job_id":"96240660-edb7-40d2-8af8-22ddd4e7d2da","job_type":"Full-time","location":"Ibeju","posted_at":"0001-01-01T00:00:00Z","salary":"","source":"jsearch","title":"GO-Lang Backend Developer at Apex Network Limited","url":"https://www.myjobally.com/job/go-lang-backend-developer-at-apex-network-limited/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"company":"Acronis","company_logo":"https://cdn.brandfetch.io/idvHgYMHBJ/w/200/h/200/theme/dark/icon.jpeg?c=1bxidIPTRtzv36oeM-tGb","company_url":"https://www.acronis.com","description":"Location: Abuja, Nigeria Job Description We are looking for skilled and motivated Senior Go Developer who, along with our excellent and modern software development team, will be responsible for working on the Vendor Portal product. This is an individual contributor position that will be responsible for the development of backend services in Go. Every member of our “A-Team” has an instrumental role and impact on the success of Acronis’ innovative and growing business, so we are looking for someone who enjoys working in dynamic, global teams and thrives in a fast-paced and rapidly changing work environment. Just like everyone at Acronis, the ideal candidate will embody all of our company values: responsive, alert, detail-oriented, makes decisions, and never gives up. Responsibilites What you'll do: Designing and developing scalable, robust, testable, efficient, and easily maintainable code in Go Owning and maintaining backend components part of a microservice architecture Implementing designs, unit tests, debugging and integrating code, performing code reviews Collaborating with PMs, QA, Architects and other stakeholders Taking part of the whole Software Development Life Cycle Mentoring more junior colleagues and helping them grow professionally. Experience & Qualifications What you bring: 5+ years of experience writing well-designed, high-quality production code in Go, C++ or other compiled languages Experience with scalable applications with microservice architectures Knowledge of software engineering principles: standard algorithms, data structures, multi-threading and concurrency Knowledge of CI/CD systems is a plus Understanding of networking is an advantage Fluent English Application Closing Date Not Specified. How to Apply Interested and qualified candidates should: Click here to apply online","id":"f1469a6b-4bd1-4cd2-98e9-f23095a97c1e","is_remote":false,"job_id":"8c477227-e0fa-473a-ae6a-f63d1ef6c359","job_type":"Full-time","location":"Abuja","posted_at":"0001-01-01T00:00:00Z","salary":"","source":"jsearch","title":"Senior Golang Developer (Vendor Portal)+Acronis","url":"https://betajob.com.ng/senior-golang-developer-vendor-portal-acronis/19533?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"company":"confidential","company_logo":"","company_url":"https://confidential.careers","description":"Canonical – We deliver open source to the world faster, more securely, and more cost-effectively than any other company. We develop Ubuntu, the world’s most popular enterprise Linux from cloud to edge, together with a passionate global community of 200,000 contributors. Ubuntu means ‘humanity to others. We chose it because it embodies the generosity at the heart of open source, the new normal for platforms and innovation.\n\nTogether with a community of 200,000, we publish an operating system that runs from the tiny connected devices up to the world’s biggest mainframes, the platform that everybody uses on the public cloud, and the workstation experience of the world’s most productive developers. Secure and reliable, elegant and intuitive, and open for innovation – Ubuntu is the future of open source, which is why it’s the fastest-growing Linux in the world despite already being the most widely deployed.\n\nWe are recruiting to fill the position below:\n\nJob Title: Senior Juju Software Engineer (Go)\n\nLocation: Nigeria\n\nThe role of a Senior Software Engineer at Canonical\n• As a senior software engineer, you’ll be an integral part of the team, driving process improvement, assisting the manager in running the team, coaching and developing colleagues with less experience, as well as owning functional areas from design and implementation all the way to support and maintenance.\n• Juju is the engine behind model-driven operations, providing a means to operate complex software on public cloud, private cloud, Kubernetes, and bare-metal. Combined with the Ops framework, Juju provides a complete solution for applications and infrastructure management.\n• Many internal and external teams depend on Juju to deliver their products and services – from Canonical Managed Solutions, our OpenStack and cloud delivery teams, to Fortune 500 companies.\n\nWhat your day will look like\n• Own the design, delivery, and support of features in a highly concurrent, highly distributed system that drives cloud automation and software operations at scale.\n• Collaborate proactively with a distributed team\n• Debug issues and interact with upstream communities publicly\n• Work with helpful and talented engineers including experts in many fields\n• Discuss ideas and collaborate on finding good solutions\n• Coach and develop team members with less experience, actively contributing to building and maintaining a first-class engineering team.\n• Work from home with global travel for 2 to 4 weeks per year for internal and external events\n\nWhat we are looking for in you\n• Proven track record of professional software delivery using Go.\n• Hands-on experience developing highly concurrent distributed systems\n• Excellent communication skills in the English language, both verbal and written, especially in online environments\n• An exceptional academic track record from both high school and preferably university\n• Experience with agile software development methodologies\n• Willingness to travel up to 4 times a year for internal events\n\nAdditional skills that you might also bring:\nThe following skills may be helpful to you in the role, but we don’t expect everyone to bring all of them.\n• Experience with container technologies (Docker, LXD, Kubernetes, etc.)\n• Experience doing development in C, C++, Rust, or other low-level programming languages.\n• Solid networking background and experience\n• Experience in the Linux and open-source software world\n• Experience with configuration management software (Ansible, Chef, Puppet, et al.)\n• Working knowledge of cloud computing\n• Passionate about software quality and testing\n• Experience with packaging (Debian, snaps)\n• Programming with, and operating, SQL and NoSQL databases\n• Experience working on a distributed team on an open source project — even if that is community open source contributions.\n• Demonstrated track record of Open Source contributions\n• Prior experience developing plugins for Terraform.\n\nWhat we offer you\n• We consider geographical location, experience, and performance in shaping compensation worldwide.\n• We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus.\n• We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\n• Distributed work environment with twice-yearly team sprints in person – we’ve been working remotely since 2004!\n• Personal learning and development budget of USD 2,000 per year\n• Annual compensation review\n• Recognition rewards\n• Annual holiday leave\n• Maternity and paternity leave\n• Employee Assistance Programme\n• Opportunity to travel to new locations to meet colleagues from your team and others\n• Priority Pass for travel and travel upgrades for long haul company events.\n\nApplication Closing Date\nNot Specified.\n\nHow to Apply\nInterested and qualified candidates should:\nCLICK HERE TO APPLY","id":"4d8d7044-6418-4893-acad-88f037781515","is_remote":false,"job_id":"198c1c33-7104-4824-aa86-c37532680527","job_type":"Full-time","location":"Nigeria","posted_at":"0001-01-01T00:00:00Z","salary":"","source":"jsearch","title":"Senior Juju Software Engineer (Go) at Canonical Nigeria (Remote)","url":"https://ng.jooble.org/jdp/-1731902509638568893?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"},{"company":"Acronis","company_logo":"https://cdn.brandfetch.io/idvHgYMHBJ/w/200/h/200/theme/dark/icon.jpeg?c=1bxidIPTRtzv36oeM-tGb","company_url":"https://www.acronis.com","description":"Acronis is revolutionizing cyber protection by unifying backup, disaster recovery, storage, next-generation anti-malware, and protection management into one solution. This all-in-one integration removes the complexity and risks associated with non-integrated solutions and offers easy, complete and reliable data protection for all workloads, applications, and systems across any environment—all at a low and predictable cost.\n\nJob Position: GoLang Developer (Advanced Automation)\n\nJob Location: Abuja, Nigeria\n\nJob Responsibilities\n• Analyse, research and develop functionality to roadmap requirements;\n• Participate in design and peer code reviews.\n• Develop unit tests and planform features;\n• Support QA team in technical matters;\n• Overlook deployments and maintain the code after it’s deployed.\n\nJob Requirements\n• At least 3 years of experience writing well-designed, high-quality production code\n• Solid knowledge and experience with GoLang, JavaScript\n• Experience with databases (MySQL or PostgreSQL)\n• Knowledge of the principles of REST / RESTful\n• Strong knowledge of software implementation best practices\n• Knowledge of MSSQL, stored procedures, and/or C# will be a plus\n• Good interpersonal, written and verbal communication skills\n• Fluent English\n\nHow to Apply\n\nInterested and qualified candidates should:\n\nClick here to apply online\n\nTagged as: Information Technology","id":"3746dffc-bcae-4976-ac91-493773d13553","is_remote":false,"job_id":"91c7a809-f9e8-49c3-9414-983d9514ab98","job_type":"Full-time","location":"Abuja","posted_at":"0001-01-01T00:00:00Z","salary":"","source":"jsearch","title":"GoLang Developer at Acronis","url":"https://jobnetworknigeria.com/job/golang-developer-at-acronis/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"}],"lastFetchTime":1744942149634}